import React from 'react';
import { View, Text } from 'react-native';

import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';
import ಪೂರ್ವಾ೦ಗ from '../../Vishaya/Purvanga';
import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';



export default  ಸಾಯ೦ಅಭಿಮ೦ತ್ರಣೆ = () => (
<View>
<ಶೀರ್ಷಿಕೆ>
 ಅಭಿಮ೦ತ್ರಣೆ
</ಶೀರ್ಷಿಕೆ>

<ಪೂರ್ವಾ೦ಗ>
  ಅಗ್ನಿಶ್ಚೇತ್ಯಸ್ಯ ಮ೦ತ್ರಸ್ಯ ಅಗ್ನಿಮಾ ಮನ್ಯುಃ ಮನ್ಯುಪತಯಃ ರಾತ್ರಿರ್ದೇವತಾ ಪ್ರಕೃತಿಪುರುಷ೦ ಛ೦ದ: ಜಲಾಭಿಮ೦ತ್ರಣೇ ವಿನಿಯೋಗಃ ॥
</ಪೂರ್ವಾ೦ಗ>

<ವಿನಿಯೋಗ>
 ಅಗ್ನಿಶ್ಚ ಮಾ ಮನ್ಯುಶ್ಚ ಮನ್ಯುಪತಯಶ್ಚ ಮನ್ಯು॑ಕೃತೇ॒ಭ್ಯಃ । ಪಾಪೇಭ್ಯೋ॑ ರಕ್ಷ॒೦ತಾಮ್ । 
 ಯದ್ರಾತ್ರ್ಯಾ ಪಾಪ॑ಮಕಾ॒ರ್ಷಮ್ । ಮನಸಾ ವಾಚಾ॑ ಹಸ್ತಾ॒ಭ್ಯಾ೦ । ಪದ್ಭ್ಯಾ೦ ಉದರೇ॑ಣ ಶಿ॒ಶ್ಞಾ ।
 ರಾತ್ರಿ॒ಸ್ತದ॑ವಲು॒೦ಪತು । ಯತ್ಕಿ೦ಚ॑ ದುರಿ॒ತ೦ ಮಯಿ॑ । 
 ಇದಮಹ೦ ಮಾಮಮೃ॑ತಯೋ॒ನೌ । ಸತ್ಯೇ ಜ್ಯೋತಿಷಿ ಜುಹೋ॑ಮಿ ಸ್ವಾ॒ಹಾ ॥
</ವಿನಿಯೋಗ>

</View>

);
