import React from 'react';
import { View, Text } from 'react-native';

import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';
import ಘಟ್ಟವಿನ್ಯಾಸ from '../Ghatta.vinyasa';
import ವಿಷಯ from '../../Vishaya/Vishaya';

export default  ಸಾಯ೦ಅಭಿಮ೦ತ್ರಣೆ = () => (
<View>
<ಶೀರ್ಷಿಕೆ>
 ಅಭಿಮ೦ತ್ರಣೆ
</ಶೀರ್ಷಿಕೆ>

<ವಿಷಯ ವಿನ್ಯಾಸ = {ಘಟ್ಟವಿನ್ಯಾಸ.ಪೂರ್ವಾ೦ಗ}>
  ಅಗ್ನಿಶ್ಚೇತ್ಯಸ್ಯ ಮ೦ತ್ರಸ್ಯ ಅಗ್ನಿಮಾ ಮನ್ಯುಃ ಮನ್ಯುಪತಯಃ ರಾತ್ರಿರ್ದೇವತಾ ಪ್ರಕೃತಿಪುರುಷ೦ ಛ೦ದ: ಜಲಾಭಿಮ೦ತ್ರಣೇ ವಿನಿಯೋಗಃ ॥
</ವಿಷಯ>

<ವಿಷಯ ವಿನ್ಯಾಸ = {ಘಟ್ಟವಿನ್ಯಾಸ.ವಿನಿಯೋಗ}>
 ಅಗ್ನಿಶ್ಚ ಮಾ ಮನ್ಯುಶ್ಚ ಮನ್ಯುಪತಯಶ್ಚ ಮನ್ಯು॑ಕೃತೇ॒ಭ್ಯಃ । ಪಾಪೇಭ್ಯೋ॑ ರಕ್ಷ॒೦ತಾಮ್ । 
 ಯದ್ರಾತ್ರ್ಯಾ ಪಾಪ॑ಮಕಾ॒ರ್ಷಮ್ । ಮನಸಾ ವಾಚಾ॑ ಹಸ್ತಾ॒ಭ್ಯಾ೦ । ಪದ್ಭ್ಯಾ೦ ಉದರೇ॑ಣ ಶಿ॒ಶ್ಞಾ ।
 ರಾತ್ರಿ॒ಸ್ತದ॑ವಲು॒೦ಪತು । ಯತ್ಕಿ೦ಚ॑ ದುರಿ॒ತ೦ ಮಯಿ॑ । 
 ಇದಮಹ೦ ಮಾಮಮೃ॑ತಯೋ॒ನೌ । ಸತ್ಯೇ ಜ್ಯೋತಿಷಿ ಜುಹೋ॑ಮಿ ಸ್ವಾ॒ಹಾ ॥
</ವಿಷಯ>

</View>

);
