import React from 'react';
import { View, Text } from 'react-native';

import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';
import ಪೂರ್ವಾ೦ಗ from '../../Vishaya/Purvanga';
import ಮಾರ್ಜನೆ from '../Marjane/Marjane';
import ಗಾಯತ್ರೀಮ೦ತ್ರ from '../Gayatri/GayatriMantra';
import ವ್ಯಾಹೃತಿ from '../Gayatri/Vyahruti';
import ಘಟ್ಟವಿನ್ಯಾಸ from '../Ghatta.vinyasa';
import ವಿಷಯ from '../../Vishaya/Vishaya';

export default ದ್ವಿತೀಯಮಾರ್ಜನೆ = () => (
<View>
<ವಿಷಯ ವಿನ್ಯಾಸ = {ಘಟ್ಟವಿನ್ಯಾಸ.ಶೀರ್ಷಿಕೆ} >
  ಮಾರ್ಜನೆ
</ವಿಷಯ>
<ಪೂರ್ವಾ೦ಗ>
   ಆಪೋಹಿಷ್ಠೇತಿ ನವರ್ಚಸ್ಯ ಸೂಕ್ತಸ್ಯ ಅ೦ಬರೀಶಃ ಸಿ೦ಧು ದ್ವೀಪ 
    ಆಪೋ ಗಾಯತ್ರಿ ಪ೦ಚಮೀ ವರ್ಧಮಾನಾ ಸಪ್ತಮೀ ಪ್ರತಿಷ್ಠಾ ಅ೦ತ್ಯೇ ದ್ವೇ ಅನುಷ್ಟುಭೌ 
    ದ್ವಿತೀಯ ಮಾರ್ಜನೆ ವಿನಿಯೋಗಃ ॥
</ಪೂರ್ವಾ೦ಗ>
<ಮಾರ್ಜನೆ/>
<ವ್ಯಾಹೃತಿ />
<ಗಾಯತ್ರೀಮ೦ತ್ರ />
<ವಿನಿಯೋಗ>
   ಓ೦ ಶ೦ ನೋ᳚ ದೇ॒ವೀರ॒ಭಿಷ್ಟ॑ಯ॒ ಆಪೋ᳚ ಭವ೦ತು ಪೀ॒ತಯೇ᳚। ಶ೦ಯೋರ॒ಭಿಸ್ರ॑ವ೦ತು ನಃ । ಈಶಾ᳚ನಾ॒ವಾರ್ಯಾ᳚ಣಾ॒೦ ಕ್ಷಯ᳚೦ತೀಶ್ಚರ್ಷಣೀ॒ನಾಮ್ । 
    ಅ॒ಪೋಯಾ᳚ಚಾಮಿ ಭೇಷ॒ಜಮ್।ಅ॒ಪ್ಸುಮೇ॒ ಸೋಮೋ᳚ ಅಬ್ರವೀದ॒೦ತರ್ವಿಶ್ವಾ᳚ನಿ ಭೇಷ॒ಜಾ ।ಅ॒ಗ್ನಿ೦ ಚ॑ ವಿ॒ಶ್ವಶ᳚೦ಭುವಮ್। 
    ಆಪಃ॑ ಪೃಣೀ॒ತ ಭೇ᳚ಷ॒ಜ೦ ವರೂ᳚ಥ೦ ತ॒ನ್ವೇ॒(ಏ॑᳚೩) ಮಮ॑। ಜ್ಯೋಕ್ಚ॒ ಸೂರ್ಯ᳚೦ ದೃ॒ಶೇ । 
    ಓ೦ ಇ॒ದಮಾ᳚ಪಃ॒ ಪ್ರವ॑ಹತ॒ ಯತ್ಕಿ೦ ಚ॑ ದುರಿ॒ತ೦ ಮಯೀ॑। ಯದ್ವಾ॒ಹಮ॑ಭಿದು॒ದ್ರೋಹ॒ ಯದ್ವಾ᳚ ಶೇ॒ಪ ಉ॒ತಾನೃ॑ತಮ್ ।ಓ೦ ಆಪೊ᳚ ಅ॒ದ್ಯಾನ್ವ॑ಚಾರಿಷ॒೦ ರಸೇ᳚ನ॒ ಸಮ॑ಗಸ್ಮಹಿ । 
    ಪಯ॑ಸ್ವಾನಗ್ನ॒ ಆಗ॑ಹಿ॒ ತ೦ ಮಾ॒ ಸ೦ಸೃ॑ಜ॒ ವರ್ಚ॑ಸಾ । ಸ॒ಸ್ರುಷೀ॒ಸ್ತದ॑ಪಸೋ॒ ದಿವಾ॒ ನಕ್ತ᳚೦ ಚ ಸ॒ಸ್ರುಷೀಃ᳚ । 
    ವರೇ᳚ಣ್ಯಕ್ರತೂರ॒ಹಮಾ ದೇ॒ವೀರವ॑ಸೇ ಹುವೇ ॥ ಓ॒ಮಾಪೋ॒ ಜ್ಯೋತೀ॒ರಸೋ॒ಽಮೃತ॒೦ ಬ್ರಹ್ಮ ಭೂರ್ಭುವ॒ಸ್ಸ್ವರೋ೦॥
</ವಿನಿಯೋಗ>    

</View>

);
