import React from 'react';
import { View, Text } from 'react-native';

import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';
import ಪೂರ್ವಾ೦ಗ from '../../Vishaya/Purvanga';
import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';
import ಘಟ್ಟವಿನ್ಯಾಸ from '../Ghatta.vinyasa';
import ವಿಷಯ from '../../Vishaya/Vishaya';

export default ವಿಸರ್ಜನೆ = () => (
<View>
<ಶೀರ್ಷಿಕೆ>
  ವಿಸರ್ಜನೆ
</ಶೀರ್ಷಿಕೆ>
<ಪೂರ್ವಾ೦ಗ>
ಋತ೦ಚ ಸತ್ಯ೦ಚ ಇತ್ಯಸ್ಯ ಸೂಕ್ತಸ್ಯ ಅಘಮರ್ಷಣ ಋಷಿಃ
     ಭಾವವೃತ್ತೋ ದೇವತಾ ಅನುಷ್ಟುಭ್ ಛ೦ದಃ ಪಾಪ ಪುರುಷ ವಿಸರ್ಜನೆ ವಿನಿಯೋಗಃ ।
</ಪೂರ್ವಾ೦ಗ>
<ವಿನಿಯೋಗ>
ಓ೦ ಋ॒ತ೦ ಚ॑ ಸ॒ತ್ಯ೦ ಚಾ॒ಭೀ᳚ದ್ಧಾ॒ತ್ತಪ॒ಸೋಽಧ್ಯ॑ಜಾಯತ । ತತೋ॒ ರಾತ್ರ್ಯಾ॑ಜಾಯತ॒ ತತಃ॑ ಸಮು॒ದ್ರೋ ಅ᳚ರ್ಣ॒ವಃ ।
    ಸ॒ಮು॒ದ್ರಾದ᳚ರ್ಣ॒ವಾದಧಿ॑ ಸ೦ವತ್ಸ॒ರೋ ಅ॑ಜಾಯತ । ಅ॒ಹೋ॒ರಾ॒ತ್ರಾಣಿ॑ ವಿ॒ದಧ॒ದ್ವಿಶ್ವ॑ಸ್ಯ ಮಿಷ॒ತೋ ವ॒ಶೀ । 
    ಸೂ॒ರ್ಯಾ॒ ಚ॒೦ದ್ರ॒ಮಸೌ᳚ ಧಾ॒ತಾ ಯ॑ಥಾ ಪೂ॒ರ್ವಮ॑ಕಲ್ಪಯತ್ । ದಿವ᳚೦ ಚ ಪೃಥಿ॒ವೀ೦ ಚಾ॒೦ತರಿ॑ಕ್ಷ॒ಮಥೋ॒ ಸ್ವಃ॑ । 
    ದ್ರು॒ಪ॒ದಾದಿ॑ವ ಮು೦ಚತು । ದ್ರು॒ಪ॒ದಾ॑ದಿ॒ವೇನ್ಮು॑ಮುಚಾ॒ನಃ । ಸ್ವಿ॒ನ್ನಃ ಸ್ನಾ॒ತ್ವೀ ಮಲಾ॑ದಿವ । 
    ಪೂ॒ತ೦ ಪವಿತ್ರೇ॑ಣೇ॒ವಾಜ್ಯ᳚೦ ।ಆಪಃ॑ ಶ್ಯು೦ಧ೦ತು॒ ಮೈನ॑ಸಃ । (ಹಸ್ತ೦ ಪ್ರಕ್ಷಾಳ್ಯ)
</ವಿನಿಯೋಗ>

</View>

);
