import React from 'react';

import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';
import ಪೂರ್ವೋತ್ತರ from '../../Vishaya/Purvanga';
import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';
import ಆವರಣ from '../../Avarana/Avarana';
import ವಿಧಾನ from '../../Vishaya/Vidhana';

export default ಪಾದ್ಯ = () => (
    <ಆವರಣ>
    <ಶೀರ್ಷಿಕೆ>
      ಪಾದ್ಯ
    </ಶೀರ್ಷಿಕೆ>
    <ವಿನಿಯೋಗ >

    ಏ॒ತಾವಾ॑ನಸ್ಯ ಮಹಿ॒ಮಾ । ಅತೋ॒ ಜ್ಯಾಯಾಗ್॑ಶ್ಚ॒ ಪೂರು॑ಷಃ । ಪಾದೋ᳚ಽಸ್ಯ॒ ವಿಶ್ವಾ॑ ಭೂ॒ತಾನಿ॑ । ತ್ರಿ॒ಪಾದ॑ಸ್ಯಾ॒ಮೃತಂ॑ ದಿ॒ವಿ ।

     </ವಿನಿಯೋಗ>
    <ಪೂರ್ವೋತ್ತರ>
      ಶ್ರೀ ಇಷ್ಟ ದೇವತಾಭ್ಯೋ ನಮಃ । ಪಾದ್ಯ೦ ಪಾದ್ಯ೦ ಸಮರ್ಪಯಾಮಿ ॥
    </ಪೂರ್ವೋತ್ತರ>

    <ವಿಧಾನ>
      (ಎರಡು ಉದ್ಧರಣೆ ಕಲಶೋದಕವನ್ನು ವಿಸರ್ಜಿಸುವುದು.)
    </ವಿಧಾನ>

    </ಆವರಣ>
);
