import React from 'react';

import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';
import ಪೂರ್ವಾ೦ಗ from '../../Vishaya/Purvanga';
import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';
import ಆವರಣ from '../../Avarana/Avarana';
import ವಿಧಾನ from '../../Vishaya/Vidhana';
 
export default ನೀರಾಜನ = () => (
    <ಆವರಣ>
    <ಶೀರ್ಷಿಕೆ>
      ನೀರಾಜನ
    </ಶೀರ್ಷಿಕೆ>
    <ವಿನಿಯೋಗ>
    ಸೋಮೋ॒ ವಾ ಏ॒ತಸ್ಯ॑ ರಾ॒ಜ್ಯಮಾದ॑ತ್ತೇ । ಯೋ ರಾಜಾ॒ ಸನ್ ರಾ॒ಜ್ಯೋ ವಾ॒ ಸೋಮೇ॑ನ॒ ಯಜ॑ತೇ । 
    
    ದೇ॒ವ॒ಸು॒ವಾಮೇ॒ತಾನಿ॑ ಹ॒ವೀꣳಷಿ॑ ಭವಂತಿ । ಏ॒ತಾವ॑ಂತೋ॒ ವೈ ದೇ॒ವಾನಾꣳ॑ ಸ॒ವಾಃ । ತ ಏ॒ವಾಸ್ಮೈ॑ ಸ॒ವಾನ್ ಪ್ರಯ॑ಚ್ಛಂತಿ । 
    
    ತ ಏ॑ನಂ॒ ಪುನ॑ಸ್ಸುವಂತೇ ರಾ॒ಜ್ಯಾಯ॑ । ದೇ॒ವ॒ಸೂ ರಾಜಾ॑ ಭವತಿ ॥
    
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ >
 
    ವೇದಾ॒ಹಮೇ॒ತಂ ಪುರು॑ಷಂ ಮ॒ಹಾಂತಮ್᳚ । ಆ॒ದಿ॒ತ್ಯವ॑ರ್ಣಂ॒ ತಮ॑ಸ॒ಸ್ತು ಪಾ॒ರೇ । 
    ಸರ್ವಾ॑ಣಿ ರೂ॒ಪಾಣಿ॑ ವಿ॒ಚಿತ್ಯ॒ ಧೀರಃ॑ । ನಾಮಾ॑ನಿ ಕೃ॒ತ್ವಾಽಭಿ॒ವದ॒ನ್॒, ಯದಾಸ್ತೇ᳚ ।

     </ವಿನಿಯೋಗ>
    <ಪೂರ್ವಾ೦ಗ>

      ಶ್ರೀ ಇಷ್ಟ ದೇವತಾಭ್ಯೋ ನಮಃ । ನೀರಾಜನ೦ ದರ್ಶಯಾಮಿ ॥
      
    </ಪೂರ್ವಾ೦ಗ>

    <ಪೂರ್ವಾ೦ಗ>
    ನೀರಾಜನಾನಂತರಂ ಆಚಮನೀಯಂ ಸಪರ್ಪಯಾಮಿ । ಆಚಮನಾ ನಂತರಂ ಪುಷ್ಪಾಣಿ ಸಮರ್ಪಯಾಮಿ । ರಕ್ಷಾಂ ಧಾರಯಾಮಿ ॥
    </ಪೂರ್ವಾ೦ಗ>

    </ಆವರಣ>
);
