import React from 'react';

import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';
import ಪೂರ್ವೋತ್ತರ from '../../Vishaya/Purvanga';
import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';
import ಆವರಣ from '../../Avarana/Avarana';
import ವಿಧಾನ from '../../Vishaya/Vidhana';

export default ದೀಪ = () => (
    <ಆವರಣ>
    <ಶೀರ್ಷಿಕೆ>
      ದೀಪ
    </ಶೀರ್ಷಿಕೆ>
    <ವಿನಿಯೋಗ >
  
    ಬ್ರಾ॒ಹ್ಮ॒ಣೋ᳚ಽಸ್ಯ॒ ಮುಖ॑ಮಾಸೀತ್ । ಬಾ॒ಹೂ ರಾ॑ಜ॒ನ್ಯಃ॑ ಕೃ॒ತಃ । ಊ॒ರೂ ತದ॑ಸ್ಯ॒ ಯದ್ವೈಶ್ಯಃ॑ । ಪ॒ದ್ಭ್ಯಾꣳ ಶೂ॒ದ್ರೋ ಅ॑ಜಾಯತ ।

     </ವಿನಿಯೋಗ>
    <ಪೂರ್ವೋತ್ತರ>
      ಶ್ರೀ ಇಷ್ಟ ದೇವತಾಭ್ಯೋ ನಮಃ । ದೀಪ೦ ದರ್ಶಯಾಮಿ ॥
    </ಪೂರ್ವೋತ್ತರ>
    <ವಿಧಾನ>
     (ಏಕಾರತಿ ದೀಪವನ್ನು ದೇವರಿಗೆ ದರ್ಶಿಸುವುದು.)
    </ವಿಧಾನ>
    <ಪೂರ್ವೋತ್ತರ>
       ಧೂಪದೀಪಾನ೦ತರ೦ ಆಚಮನೀಯ೦ ಸಮರ್ಪಯಾಮಿ । 
       ಆಚಮನಾನ೦ತರ೦ ದಿವ್ಯ ಪರಿಮಳ ಪತ್ರಪುಷ್ಪಾಣಿ ಸಮರ್ಪಯಾಮಿ ॥
    </ಪೂರ್ವೋತ್ತರ>
    <ವಿಧಾನ>
      (ಎರಡು ಉದ್ಧರಣೆ ಕಲಶೋದಕವನ್ನು ವಿಸರ್ಜಿಸುವುದು.ನ೦ತರ ಪುಷ್ಪಾಕ್ಷತೆಯನ್ನು ದೇವರಿಗೆ ಅರ್ಪಿಸುವುದು.)
    </ವಿಧಾನ>

    </ಆವರಣ>
);
