import React from 'react';

import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';
import ಪೂರ್ವೋತ್ತರ from '../../Vishaya/Purvanga';
import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';
import ಆವರಣ from '../../Avarana/Avarana';
import ವಿಧಾನ from '../../Vishaya/Vidhana';

export default ಉಪಚಾರಆಚಮನೀಯ = () => (
    <ಆವರಣ>
    <ಶೀರ್ಷಿಕೆ>
      ಆಚಮನೀಯ
    </ಶೀರ್ಷಿಕೆ>
    <ವಿನಿಯೋಗ >
      ತಸ್ಮಾ᳚ದ್ವಿ॒ರಾಡ॑ಜಾಯತ । ವಿ॒ರಾಜೋ॒ ಅಧಿ॒ ಪೂರು॑ಷಃ । ಸ ಜಾ॒ತೋ ಅತ್ಯ॑ರಿಚ್ಯತ । ಪ॒ಶ್ಚಾದ್ಭೂಮಿ॒ಮಥೋ॑ ಪು॒ರಃ ।
 
     </ವಿನಿಯೋಗ>
    <ಪೂರ್ವೋತ್ತರ>
      ಶ್ರೀ ಇಷ್ಟ ದೇವತಾಭ್ಯೋ ನಮಃ । ಮುಖೇ ಆಚಮನೀಯ೦ ಆಚಮನೀಯ೦ ಸಮರ್ಪಯಾಮಿ ॥
    </ಪೂರ್ವೋತ್ತರ>

    <ವಿಧಾನ>
     (ಎರಡು ಉದ್ಧರಣೆ ಕಲಶೋದಕವನ್ನು ವಿಸರ್ಜಿಸುವುದು.)
    </ವಿಧಾನ>
    </ಆವರಣ>
);
