import React from 'react';

import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';
import ಪೂರ್ವೋತ್ತರ from '../../Vishaya/Purvanga';
import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';
import ಆವರಣ from '../../Avarana/Avarana';
import ವಿಧಾನ from '../../Vishaya/Vidhana';

export default ಪುನಃಪೂಜಾ = () => (
    <ಆವರಣ>
    <ಶೀರ್ಷಿಕೆ>
       ಪುನಃಪೂಜಾ
    </ಶೀರ್ಷಿಕೆ>
    <ಪೂರ್ವೋತ್ತರ>

       ಅಥ ಪುನಃಪೂಜಾ೦ ಕರಷ್ಯೇ ।
    
    </ಪೂರ್ವೋತ್ತರ>

    <ವಿನಿಯೋಗ >
      
    ಛತ್ರಂ ಧಾರಯಾಮಿ । ಚಾಮರಂ ವೀಜಯಾಮಿ । ಗೀತಂ ಶ್ರಾವಯಾಮಿ । 
    ನಾಟ್ಯ೦ ದರ್ಶಯಾಮಿ । ವಾದ್ಯ೦ ಶ್ರಾವಯಾಮಿ । ಅಶ್ವಮಾರೋಪಯಾಮಿ ।
    ಗಜಮಾರೋಪಯಾಮಿ । ಆಂದೋಲಿಕಾಮಾರೋಪಯಾಮಿ । 
    ಸಮಸ್ತ ರಾಜೋಪಚಾರ ದೇವೋಪಚಾರ ಪೂಜಾಃ ಸಮರ್ಪಯಾಮಿ ॥
    
     </ವಿನಿಯೋಗ>

     <ವಿಧಾನ>
     (ಪುಷ್ಪಾಕ್ಷತೆಯನ್ನು ದೇವರಿಗೆ ಅರ್ಪಿಸುವುದು.)
   </ವಿಧಾನ>


    </ಆವರಣ>
);
