import React from 'react';
import { View } from 'react-native';

import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';
import ಪೂರ್ವಾ೦ಗ from '../../Vishaya/Purvanga';
import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';
import ಘಟ್ಟವಿನ್ಯಾಸ from '../Ghatta.vinyasa';
import ವಿಷಯ from '../../Vishaya/Vishaya';

export default ಅಗ್ನಿಃಪ್ರಾರ್ಥನೆ = () => (
  <View>
    <ಶೀರ್ಷಿಕೆ>
       ಅಗ್ನಿಃಪ್ರಾರ್ಥನೆ
    </ಶೀರ್ಷಿಕೆ>
    <ವಿನಿಯೋಗ>
      (ಅಗ್ನಿಗೆ ಅಭಿಮುಖವಾಗಿ ನಿ೦ತು)
    </ವಿನಿಯೋಗ>
    <ಪೂರ್ವಾ೦ಗ>
      ಓ೦ ಚಮ ಇತಿ ಸಾರಸ್ವತೋಗ್ನಿರ್ಬೃಹತಿ, ಅಗ್ನಿಃ ಪ್ರಾರ್ಥನೇ ವಿನಿಯೋಗಃ ।
    </ಪೂರ್ವಾ೦ಗ>
    <ವಿನಿಯೋಗ>
      ಓ೦ ಚ॑ಮೇ ಸ್ವ॒ರಶ್ಚ॑ಮೇ ಯಜ್ನೋ॒ ಪಚ॑ತೇ ನ॒ಮಶ್ಚ॑ । 
      ಯತ್ತೇ॒ ನ್ಯೂನ᳚೦ ತಸ್ಮೈತೇ ಉಪಯತ್ತೇ ಅತಿ॑ರಿ॒ಕ್ತ೦ ತಸ್ಮೈ॑ತೇ॒ ನಮಃ॑ । 
      ಸ್ವ॒ಸ್ತಿ ಶ್ರ॒ದ್ಧಾ೦ ಮೇ॒ಧಾ೦ ಯಶಃ॑ ಪ್ರ॒ಜ್ಞಾ೦ ವಿದ್ಯಾ॒೦ ಬುದ್ಧಿ᳚೦ ಶ್ರಿಯ॒೦ ಬಲ೦ । 
      ಆಯು॑ಷ್ಯ॒೦ ತೇಜ॑ ಆರೋ॒ಗ್ಯ೦ ದೇ॒ಹಿ॒ಮೇ ಹ॑ವ್ಯವಾ॒ಹನ ।
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ>
       ಶ್ರಿಯ೦ ದೇಹಿಮೇ ಹವ್ಯವಾಹನ ಓ೦ ನಮ ಇತಿ ।
    </ವಿನಿಯೋಗ>

  </View>

);
