import React from 'react';
import { View } from 'react-native';

import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';
import ಪೂರ್ವಾ೦ಗ from '../../Vishaya/Purvanga';
import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';
import ಘಟ್ಟವಿನ್ಯಾಸ from '../Ghatta.vinyasa';
import ವಿಷಯ from '../../Vishaya/Vishaya';

export default ಅಗ್ನಿಮೂರ್ತಿಧ್ಯಾನ = () => (
  <View>
    <ಶೀರ್ಷಿಕೆ>
      ಅಗ್ನಿಮೂರ್ತಿ ಧ್ಯಾನ
    </ಶೀರ್ಷಿಕೆ>
    <ಪೂರ್ವಾ೦ಗ>
     ಚತ್ವಾರಿಶೃ೦ಗೇತಿ ವಾಮದೇವೋ ಜಾತವೇದಾಗ್ನಿಃ ತ್ರಿಷ್ಟುಪ್ ಅಗ್ನಿಮೂರ್ತಿ ಧ್ಯಾನೇ ವಿನಿಯೋಗಃ ।
    </ಪೂರ್ವಾ೦ಗ>
    <ವಿನಿಯೋಗ>
      ಚ॒ತ್ವಾರಿ॒ ಶೃಙ್ಗಾ॒ ತ್ರಯೋ᳚ ಅಸ್ಯ॒ ಪಾದ॒ ದ್ವೇ ಶೀ॒ರ್ಷೇ॒ ಸ॒ಪ್ತ ಹಸ್ತಾ᳚ಸೊ ಅಸ್ಯ । 
      ತ್ರಿಧಾ᳚ ಬ॒ದ್ಧೋ ವೃ॑ಷ॒ಭೋ ರೋ᳚ರವೀತಿ ಮ॒ಹೋ ದೇ॒ವೋ ಮರ್ತ್ಯಾ॒ँ ಆವಿ॑ವೇಷ । 
      ಅಗ್ನಿಮೂರ್ತಿ೦ ಧ್ಯಾಯಾಮಿ ।
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ>
      ಓ೦ ಅಗ್ನಿ೦ ಪರ್ಯುಕ್ಷಣ ,ಪರಿಸಮೋಹನ , ಪರಿಷಿಚ್ಯ ।
    </ವಿನಿಯೋಗ>

  </View>

);
