import React from 'react';
import { View } from 'react-native';

import ಘಟ್ಟವಿನ್ಯಾಸ from '../Ghatta.vinyasa';
import ವಿಷಯ from '../../Vishaya/Vishaya';
import ತ್ರಿಹೃತಿ from '../Gayatri/Trihruti';

export default ಪುನಃಪೂಜಾ = () => (
  <View>
    <ವಿಷಯ ವಿನ್ಯಾಸ = {ಘಟ್ಟವಿನ್ಯಾಸ.ಶೀರ್ಷಿಕೆ} >
      ಪುನಃಪೂಜಾ
    </ವಿಷಯ>
    <ವಿಷಯ ವಿನ್ಯಾಸ = {ಘಟ್ಟವಿನ್ಯಾಸ.ವಿನಿಯೋಗ} >
      (ಅಗ್ನಿಗೆ ಅಭಿಮುಖವಾಗಿ ಕುಳಿತು)
    </ವಿಷಯ>
    <ವಿಷಯ ವಿನ್ಯಾಸ = {ಘಟ್ಟವಿನ್ಯಾಸ.ವಿನಿಯೋಗ} >
      ಹೋಮಾ೦ತೇ ಆಗ್ನಿ ಪುರುಷಾಯ ನಮಃ । ಅಕ್ಷತಾ೦ ಸಮರ್ಪಯಾಮಿ । 
      ಮ೦ಗಳದ್ರವ್ಯಾಣಿ ಸಮರ್ಪಯಾಮಿ ।
      <ತ್ರಿಹೃತಿ />
      <ತ್ರಿಹೃತಿ />
      ಯಥಾ ಭಾಗಶಃ ಆಜ್ಯೋಪಹಾರ ನಿವೇದನ೦ ಸಮರ್ಪಯಾಮಿ ।
    </ವಿಷಯ>

  </View>

);
