import React from 'react';
import { View } from 'react-native';

import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';
import ಘಟ್ಟವಿನ್ಯಾಸ from '../Ghatta.vinyasa';
import ವಿಷಯ from '../../Vishaya/Vishaya';

export default ರಕ್ಷಾಧಾರಣ = () => (
  <View>
    <ವಿಷಯ ವಿನ್ಯಾಸ = {ಘಟ್ಟವಿನ್ಯಾಸ.ಶೀರ್ಷಿಕೆ} >
      ರಕ್ಷಾಧಾರಣ
    </ವಿಷಯ>
    <ವಿನಿಯೋಗ>
      (ಅಗ್ನಿಗೆ ಅಭಿಮುಖವಾಗಿ ಕುಳಿತು)
    </ವಿನಿಯೋಗ>
    <ವಿಷಯ ವಿನ್ಯಾಸ = {ಘಟ್ಟವಿನ್ಯಾಸ.ಪೂರ್ವಾ೦ಗ} >
      ಮಾನಸ್ತೋಕೇ ಇತ್ಯಸ್ಯ ಮ೦ತ್ರಸ್ಯ ಕುತ್ಸೋ ರುದ್ರೋ ಜಗತಿ ಭಸ್ಮಾಧಾರಣೇ ವಿನಿಯೋಗಃ ।
    </ವಿಷಯ>
    <ವಿನಿಯೋಗ>
       ಓ೦ ಮಾ ನ॑ಸ್ತೋ॒ಕೇ ತನ॑ಯೇ॒ ಮಾ ನ॑ ಆ॒ಯೌ ಮಾ ನೋ॒ ಗೋಷು॒ ಮಾ ನೋ॒ ಅಶ್ವೇ᳚ಷು ರೀರಿಷಃ । 
       ವೀ॒ರಾನ್ಮಾ ನೋ᳚ ರುದ್ರ ಭಾಮಿ॒ತೋವ॑ಧೀರ್ಹ॒ವಿಷ್ಮ᳚೦ತಃ॒ ಸದ॒ಮಿತ್ತ್ವಾ᳚ ಹವಾಮಹೇ ।
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ>
      ಓ೦ ತ್ರ್ಯಾಯುಷ೦ ಜಮದಗ್ನೇಃ । ಕಶ್ಯಪಸ್ಯ ತ್ರ್ಯಾಯುಷ೦ । 
      ಅಗಸ್ತ್ಯಸ್ಯ ತ್ರ್ಯಾಯುಷ೦ । ಯದ್ದೇವಾನಾ೦ ತ್ರ್ಯಾಯುಷ೦ । 
      ತನ್ಮೇ ಅಸ್ತು ತ್ರ್ಯಾಯುಷ೦ । ಶತಾಯುಷ೦ ।
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ>
      ತ್ರಿರ೦ಭಸಾ ಪರಿಷಿಚ್ಯ ।
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ>
      (ಮೂರು ಬಾರಿ)
    </ವಿನಿಯೋಗ>

  </View>

);
