import React from 'react';
import { View } from 'react-native';

import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';
import ಪೂರ್ವಾ೦ಗ from '../../Vishaya/Purvanga';
import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';

import ವಿಷಯ from '../../Vishaya/Vishaya';

export default ಸಮಿಧಾದಾನ = () => (
  <View>
    <ಶೀರ್ಷಿಕೆ>
      ಸಮಿಧಾದಾನ
    </ಶೀರ್ಷಿಕೆ>
    <ಪೂರ್ವಾ೦ಗ>
      ಅಗ್ನಯೇ ಸಮಿಧಮಿತ್ಯಸ್ಯ ಹಿರಣ್ಯಗರ್ಭಃ ಅಗ್ನಿಃ ಬೃಹತೀ ಸಮಿಧಾದಾನೇ ವಿನಿಯೋಗಃ ।
    </ಪೂರ್ವಾ೦ಗ>
    <ವಿನಿಯೋಗ>
      ಓ೦ ಅ॒ಗ್ನಯೇ᳚ ಸ॒ಮಿಧ॒ಮಾಹಾ᳚ರ್ಷ೦ ಮಹ॒ತೇ ಜಾ॒ತವೇ᳚ದಸೇ । 
      ತಯಾ॒ ತ್ವಮ॑ಗ್ನೇ॒ ವರ್ಧ॑ಸ್ವ ಸಮಿ॒ಧಾ ಬ್ರಹ್ಮ॑ಣಾ ವ॒ಯ೦ ಸ್ವಾಹಾ᳚ ।
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ>
      ಅಗ್ನಯೇ ಜಾತವೇದಸ ಇದ೦ ನಮಮ ।
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ>
     (ಹಸ್ತ೦ ಪ್ರಕ್ಷಾಳ್ಯ) । ಓ೦ ತೇಜಸಾ ಮಾ ಸಮನಜ್ಮಿ ।
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ>
      (ಮೂರು ಬಾರಿ)
    </ವಿನಿಯೋಗ>

  </View>

);
