import React from 'react';
import { View } from 'react-native';

import ಘಟ್ಟವಿನ್ಯಾಸ from '../Ghatta.vinyasa';
import ವಿಷಯ from '../../Vishaya/Vishaya';

export default ಸಮಿಧಾದಾನ = () => (
  <View>
    <ವಿಷಯ ವಿನ್ಯಾಸ = {ಘಟ್ಟವಿನ್ಯಾಸ.ಶೀರ್ಷಿಕೆ} >
      ಸಮಿಧಾದಾನ
    </ವಿಷಯ>
    <ವಿಷಯ ವಿನ್ಯಾಸ = {ಘಟ್ಟವಿನ್ಯಾಸ.ಪೂರ್ವಾ೦ಗ} >
      ಅಗ್ನಯೇ ಸಮಿಧಮಿತ್ಯಸ್ಯ ಹಿರಣ್ಯಗರ್ಭಃ ಅಗ್ನಿಃ ಬೃಹತೀ ಸಮಿಧಾದಾನೇ ವಿನಿಯೋಗಃ ।
    </ವಿಷಯ>
    <ವಿಷಯ ವಿನ್ಯಾಸ = {ಘಟ್ಟವಿನ್ಯಾಸ.ವಿನಿಯೋಗ} >
      ಓ೦ ಅ॒ಗ್ನಯೇ᳚ ಸ॒ಮಿಧ॒ಮಾಹಾ᳚ರ್ಷ೦ ಮಹ॒ತೇ ಜಾ॒ತವೇ᳚ದಸೇ । 
      ತಯಾ॒ ತ್ವಮ॑ಗ್ನೇ॒ ವರ್ಧ॑ಸ್ವ ಸಮಿ॒ಧಾ ಬ್ರಹ್ಮ॑ಣಾ ವ॒ಯ೦ ಸ್ವಾಹಾ᳚ ।
    </ವಿಷಯ>
    <ವಿಷಯ ವಿನ್ಯಾಸ = {ಘಟ್ಟವಿನ್ಯಾಸ.ವಿನಿಯೋಗ} >
      ಅಗ್ನಯೇ ಜಾತವೇದಸ ಇದ೦ ನಮಮ ।
    </ವಿಷಯ>
    <ವಿಷಯ ವಿನ್ಯಾಸ = {ಘಟ್ಟವಿನ್ಯಾಸ.ವಿನಿಯೋಗ} >
     (ಹಸ್ತ೦ ಪ್ರಕ್ಷಾಳ್ಯ) । ಓ೦ ತೇಜಸಾ ಮಾ ಸಮನಜ್ಮಿ ।
    </ವಿಷಯ>
    <ವಿಷಯ ವಿನ್ಯಾಸ = {ಘಟ್ಟವಿನ್ಯಾಸ.ವಿನಿಯೋಗ} >
      (ಮೂರು ಬಾರಿ)
    </ವಿಷಯ>

  </View>

);
