import React from 'react';

import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';
import ಪೂರ್ವೋತ್ತರ from '../../Vishaya/Purvanga';
import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';
import ಆವರಣ from '../../Avarana/Avarana';
import ವಿಧಾನ from '../../Vishaya/Vidhana';

export default ಮಧುಪರ್ಕ = () => (
    <ಆವರಣ>
    <ಶೀರ್ಷಿಕೆ>
      ಮಧುಪರ್ಕ
    </ಶೀರ್ಷಿಕೆ>
    <ವಿನಿಯೋಗ >
   
    ಓಂ ಮಧು॒ವಾತಾ॑ ಋತಾಯ॒ತೇ ಮಧು॑ಕ್ಷರಂತಿ॒ ಸಿಂಧ॑ವಃ । ಮಾಧ್ವೀ᳚ರ್ನಃ ಸ॒೦ತ್ವೋಷ॑ಧೀಃ ।
    
    ಮಧು॒ನಕ್ತ॑ಮು॒ತೋಷ॑ಸಿ॒  ಮಧು॑ಮ॒ತ್ಪಾರ್ಥಿ॑ವ॒ಗ್॒೦ರಜಃ॑ । ಮಧು॒ ದ್ಯೌರ॑ಸ್ತು ನಃ ಪಿ॒ತಾ ॥ 
    
    ಮಧು॑ಮಾನ್ನೋ॒ ವನ॒ಸ್ಪತಿ॒ರ್ಮಧು॑ಮಾꣳ ಅಸ್ತು॒ ಸೂರ್ಯಃ॑ । ಮಾಧ್ವೀ॒ರ್ಗಾವೋ॑ ಭವಂತು ನಃ ।
 
     </ವಿನಿಯೋಗ>
    <ಪೂರ್ವೋತ್ತರ>
      ಶ್ರೀ ಇಷ್ಟ ದೇವತಾಭ್ಯೋ ನಮಃ । ಮಧುಪರ್ಕಂ ಸಮರ್ಪಯಾಮಿ । ಮಧುಪರ್ಕಾನ೦ತರ೦ ಆಚಮನೀಯ೦ ಸಮರ್ಪಯಾಮಿ ॥
    </ಪೂರ್ವೋತ್ತರ>

    </ಆವರಣ>
);
