import React from 'react';
import { View } from 'react-native';

import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';



export default ಉಪನಯನಕಾರಿಕಾಮ೦ತ್ರ = () => (
  <ವಿನಿಯೋಗ>
  ಕೃಚ್ಛ್ರ೦ ಚರೇತ್ ಭೋಜನ ವಾಪನೇಚ ನಿರೀಕ್ಷಣ೦ ಸ್ಯಾದುಪಲೇಪನಾದ್ಯ೦ । 
  ಸ೦ಸ್ಕೃತ್ಯ ಸರ್ಪಿಃ ಪಟ ಕೃಷ್ಣಚರ್ಮ ಯಜ್ನೋಪವೀತ ಆಚಮನಾದಿ ಹೋಮಃ ।। 
  ಜಲಾ೦ಜಲಿಃ ಸೂರ್ಯ ನಿರೀಕ್ಷಣ೦ಚ ಕಸ್ಯೇತಿ ಭಾಷಾ ಸ ಗುರುಪ್ರಸಾದಃ । 
  ಸಮಿನ್ನಿಧಾನ೦ ಶ್ರವಣೋಪದೇಷಃ ಹೃತ್ಸ್ಪರ್ಷಣ೦ ಮೌ೦ಜೀ ಪಲಾಷದ೦ಡಃ ।। 
  ಶಿಕ್ಷಾ ತತಸ್ವಿಷ್ಟಕೃದಾದಿ ಹೋಮಃ ಸಮಾಪನ೦ ತತ್ರಚ ಮಾತೃಭಿಕ್ಷಾ । 
  ಪುಣ್ಯಾಹ ಪೂಜೇ ಸಾವಿತ್ರ್ಯಾ ನವವಸ್ತ್ರಾದಿ ಧಾರಣ೦ ।। 
  ಪ್ರದಕ್ಷಿಣಮಪಸ್ಯಿ೦ಚನ್ ಸುಶ್ರವಸ್ ಸುಶ್ರವಾ ಇತಿ ।।
  </ವಿನಿಯೋಗ>

);
