import React from 'react';

import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';
import ಪೂರ್ವಾ೦ಗ from '../../Vishaya/Purvanga';
import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';
import ಆವರಣ from '../../Avarana/Avarana';
import ವಿಧಾನ from '../../Vishaya/Vidhana';

export default ಧ್ಯಾನಆವಾಹನ = () => (
    <ಆವರಣ>
    <ಶೀರ್ಷಿಕೆ>
       ಧ್ಯಾನ-ಆವಾಹನ
    </ಶೀರ್ಷಿಕೆ>
    <ಪೂರ್ವಾ೦ಗ >
      ಅಥ ಇಷ್ತದೇವತಾ೦ ಉದ್ದಿಶ್ಯ ಪುರುಷ ಸೂಕ್ತ ಸಹಿತ ಧ್ಯಾನಾವಾಹನಾದಿ ಷೋಡಶೋಪಚಾರ ಪೂಜಾಂ ಕರಿಷ್ಯೇ ॥
    </ಪೂರ್ವಾ೦ಗ>
    <ವಿನಿಯೋಗ >
      ಓಂ ಸ॒ಹಸ್ರ॑ಶೀರ್ಷಾ॒ ಪುರು॑ಷಃ । ಸ॒ಹ॒ಸ್ರಾ॒ಕ್ಷಃ ಸ॒ಹಸ್ರ॑ಪಾತ್ । ಸ ಭೂಮಿಂ॑ ವಿ॒ಶ್ವತೋ॑ ವೃ॒ತ್ವಾ । ಅತ್ಯ॑ತಿಷ್ಠದ್ದಶಾಂಗು॒ಲಮ್ ।
    </ವಿನಿಯೋಗ>
    <ಪೂರ್ವಾ೦ಗ>
      ಶ್ರೀ ಇಷ್ಟ ದೇವತಾಭ್ಯೋ ನಮಃ । ಧ್ಯಾನ೦ ಸಮರ್ಪಯಾಮಿ ॥ ಆವಾಹಯಾಮಿ ॥
    </ಪೂರ್ವಾ೦ಗ>

    </ಆವರಣ>
);
