import React from 'react';

import ಲೇಖನ from '../Lekhana/Lekhana';
import ಪುಟ from '../Puta/Puta';
import ವಿಷಯ from '../Vishaya/Vishaya';
import ಘಟ್ಟವಿನ್ಯಾಸ from '../Ghatta/Ghatta.vinyasa';

export default ಯಜ್ಞೋಪವೀತ = () =>

  (
    <ಲೇಖನ>
      <ಪುಟ>
        <ವಿಷಯ ವಿನ್ಯಾಸ={ಘಟ್ಟವಿನ್ಯಾಸ.ಶೀರ್ಷಿಕೆ}>
          ಧಾರಣ
       </ವಿಷಯ>
        <ವಿಷಯ ವಿನ್ಯಾಸ={ಘಟ್ಟವಿನ್ಯಾಸ.ಪೂರ್ವಾ೦ಗ}>
          ಯಜ್ಞೋಪವೀತಮಿತ್ಯಸ್ಯ ಪರಬ್ರಹ್ಮಾ ಪರಮಾತ್ಮಾ ತ್ರಿಷ್ಟುಪ್,ಯಜ್ಞೋಪವೀತ ಧಾರಣೇ ವಿನಿಯೋಗಃ ॥
      </ವಿಷಯ>
        <ವಿಷಯ ವಿನ್ಯಾಸ={ಘಟ್ಟವಿನ್ಯಾಸ.ವಿನಿಯೋಗ}>
          ಯ॒ಜ್ಞೋ॒ಪ॒ವೀ॒ತ೦ ಪ॒ರಮ᳚೦ ಪವಿ॒ತ್ರ೦ ಪ್ರ॒ಜಾಪ॑ತೇರ್ಯತ್ಸ॒ಹಜ᳚೦ ಪು॒ರಸ್ತಾ᳚ತ್ ।
          ಆಯು॑ಷ್ಯಮಗ್ರಿ॒ಯ॒೦ ಪ್ರ॒ತಿಮು॑೦ಚ ಶು॑ಭ್ರ೦ ಯ॑ಜ್ಞೋಪವೀ॒ತ೦ ಬ॒ಲಮ॑ಸ್ತು॒ ತೇಜಃ॑ ॥
       </ವಿಷಯ>
      </ಪುಟ>
      <ಪುಟ>
      <ವಿಷಯ ವಿನ್ಯಾಸ={ಘಟ್ಟವಿನ್ಯಾಸ.ಶೀರ್ಷಿಕೆ}>
      ವಿಸರ್ಜನ
     </ವಿಷಯ>
     <ವಿಷಯ ವಿನ್ಯಾಸ={ಘಟ್ಟವಿನ್ಯಾಸ.ವಿನಿಯೋಗ}>
      ಉಪವೀತ೦ ಭಿನ್ನತ೦ತು೦ ಜೀರ್ಣ ಕಶ್ಮಲದೊಷಿತ೦ । 
      ವಿಸೃಜಾಮಿ ಯಶೋಬ್ರಹ್ಮನ್ ವರ್ಚೋ ದೀರ್ಘಾಯುರಸ್ತು ಮೇ ॥ ಸಮುದ್ರ೦ ಗಚ್ಛಸ್ವಾಹಾ ॥
     </ವಿಷಯ>
    </ಪುಟ>

    </ಲೇಖನ>
  );

