import React from 'react';

import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';
import ಪೂರ್ವಾ೦ಗ from '../../Vishaya/Purvanga';
import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';
import ಆವರಣ from '../../Avarana/Avarana';
import ವಿಧಾನ from '../../Vishaya/Vidhana';

export default ಕಲಶಾರ್ಚನೆ = () => (
    <ಆವರಣ>
    <ಶೀರ್ಷಿಕೆ>
      ಕಲಶಾರ್ಚನೆ
    </ಶೀರ್ಷಿಕೆ>
    <ಪೂರ್ವಾ೦ಗ >
      ತದಂಗತ್ವೇನ ಕಲಶಾರಾಧನಂ ಕರಿಷ್ಯೇ ।
    </ಪೂರ್ವಾ೦ಗ>
    <ವಿಧಾನ >
      ಕಲಶಂ ಗಂಧಾಕ್ಷತ ಪತ್ರ ಪುಷ್ಪೈಃ ಅಭ್ಯರ್ಚ್ಯ । ಹಸ್ತೇನಾಚ್ಛಾದ್ಯ ।।
    </ವಿಧಾನ>
    <ವಿನಿಯೋಗ >
      ಕಲಶಸ್ಯ ಮುಖೇ ವಿಷ್ಣುಃ ಕಂಠೇ ರುದ್ರಸ್ಸಮಾಶ್ರಿತಃ । ಮೂಲೇ ತತ್ರ ಸ್ಥಿತೋ ಬ್ರಹ್ಮಾ ಮಧ್ಯೇ ಮಾತೃಗಣಾಸ್ಸ್ಮೃತಾಃ ।।
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ >
      ಕುಕ್ಷೌ ತು ಸಾಗರಾಸ್ಸರ್ವೇ ಸಪ್ತದ್ವೀಪಾ ವಸುಂಧರಾ । ಋಗ್ವೇದೋಥ ಯಜುರ್ವೇದಃ ಸಾಮವೇದೋ ಹ್ಯಥರ್ವಣಃ ।।
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ >
      ಅಂಗೈಶ್ಚ ಸಹಿತಾಸ್ಸರ್ವೇ ಕಲಶಾಂಬು ಸಮಾಶ್ರಿತಾಃ । ಆಯಾಂತು ದೇವಪೂಜಾರ್ಥಂ ದುರಿತಕ್ಷಯಕಾರಕಾಃ ।।
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ >
      ಗಂಗೇ ಚ ಯಮುನೇ ಚೈವ ಗೋದಾವರಿ ಸರಸ್ವತಿ । ನರ್ಮದೇ ಸಿಂಧು ಕಾವೇರಿ ಜಲೇಸ್ಮಿನ್ ಸನ್ನಿಧಿಂ ಕುರು ।।
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ >
    ಆಪೋ॒ವಾ ಇ॒ದಗ್೦ ಸರ್ವ॒೦ ವಿಶ್ವಾ॑ ಭೂ॒ತಾನ್ಯಾಪ॑ಃ ಪ್ರಾ॒ಣಾವಾ ಆಪ॑ಃ ಪ॒ಶವ॒ ಆಪೋऽನ್ನ॒ಮಾಪೋऽಮೃ॑ತ॒ಮಾಪ॑ಸ್ಸ॒ಮ್ರಾಡಾಪೋ॑
     ವಿ॒ರಾಡಾಪ॑ಸ್ಸ್ವ॒ರಾಡಾಪ॒ಶ್ಚ೦ದಾ॒ಗ್॒ಸ್ಯಾಪೋ॒ ಜ್ಯೋತೀ॒ಗ್॒ಷ್ಯಾಪೋ॒ ಯಜೂ॒ಗ್॒ಷ್ಯಾಪ॑ಸ್ಸ॒ತ್ಯಮಾಪ॒ಸ್ಸರ್ವಾ॑ 
     ದೇ॒ವತಾ॒ ಆಪೋ॒ ಭೂರ್ಭುವ॒ಸ್ಸುವ॒ರಾಪ॒ ಓ೦ ॥

    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ>
    ಇ॒ಮ೦ ಮೇ॑ ಗ೦ಗೇ ಯಮುನೇ ಸರಸ್ವತಿ॒  ಶುತು॑ದ್ರಿ॒ಸ್ತೋಮಗ್॑೦ ಸಚತಾ॒ ಪರು॒ಷ್ಣಿಯಾ ।
    ಅ॒ಸಿ॒ಕ್ನಿ॒ಯಾ  ಮ॑ರುದ್ವೃಧೇ  ವಿ॒ತಸ್ತ॒ಯಾ-ऽऽರ್ಜೀ॑ಕೀಯೇ  ಶೃಣು॒ಹ್ಯಾ  ಸು॒ಷೋಮ॑ಯಾ ॥
    </ವಿನಿಯೋಗ>
    </ಆವರಣ>
);
