import React from 'react';
import { View } from 'react-native';

import ಪೂರ್ವಾ೦ಗ from '../../Vishaya/Purvanga';
import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';

import ವಿಷಯ from '../../Vishaya/Vishaya';

export default ಚಿತ್ರ೦ದೇವಾನಾ೦ = () => (
  <View>
    <ಪೂರ್ವಾ೦ಗ>
     ಚಿತ್ರ೦ ದೇವಾನಾ೦ ಇತಿ ಷಡರ್ಚಸ್ಯ ಸೂಕ್ತಸ್ಯ ಆ೦ಗೀರಸಃ ಪುತ್ರ ಕುತ್ಸ ಋಷಿಃ ಸೂರ್ಯೋ ದೇವತಾ ತ್ರಿಷ್ಟುಪ್ ಛ೦ದಃ 
     ಸೂರ್ಯೋಪಸ್ಥಾನೇ ವಿನಿಯೋಗಃ ।
    </ಪೂರ್ವಾ೦ಗ>

    <ವಿನಿಯೋಗ>
     ಚಿ॒ತ್ರ೦ದೇ॒ವಾನಾ॒ಮುದ॑ಗಾ॒ದನೀ᳚ಕ॒೦ ಚಕ್ಷು᳚ರ್ಮಿ॒ತ್ರಸ್ಯ॒ ವರು॑ಣಸ್ಯಾ॒ಗ್ನೇಃ । 
     ಆಪ್ರಾ॒ದ್ಯಾವಾ᳚ಪೃಥಿ॒ವೀ ಅ॒೦ತರಿ॑ಕ್ಷ॒೦ ಸೂರ್ಯ॑ ಆ॒ತ್ಮಾ ಜಗ॑ತಸ್ತ॒ಸ್ಥುಷ॑ಶ್ಚ ॥
     ಸೂರ್ಯೋ᳚ ದೇ॒ವೀಮು॒ಶಸ॒೦ ರೋಚ॑ಮಾನಾ॒೦ ಮರ್ಯೋ॒ ನ ಯೋಷಾ᳚ಮ॒ಭ್ಯೇ᳚ತಿ ಪ॒ಶ್ಚಾತ್ ।
     ಯತ್ರಾ॒ ನರೋ᳚ ದೇವ॒ಯ೦ತೋ᳚ ಯು॒ಗಾನಿ॑ ವಿತನ್ವ॒ತೇ ಪ್ರತಿ॑ ಭ॒ದ್ರಾಯ॑ ಭ॒ದ್ರಮ್ ॥ 
     ಭ॒ದ್ರಾ ಅಶ್ವಾ᳚ ಹ॒ರಿತಃ॒ ಸೂರ್ಯ॑ಸ್ಯ ಚಿ॒ತ್ರಾ ಏತ॑ಗ್ವಾ ಅನು॒ಮಾದ್ಯಾ᳚ಸಃ ।
     ನ॒ಮ॒ಸ್ಯ೦ತೋ᳚ ದಿ॒ವ ಆ ಪೃ॒ಷ್ಠಮ॑ಸ್ಥುಃ॒ ಪರಿ॒ ದ್ಯಾವಾ᳚ಪೃಥಿ॒ವೀ ಯ᳚೦ತಿ ಸ॒ದ್ಯಃ ॥
     ತತ್ಸೂರ್ಯ॑ಸ್ಯ ದೇವ॒ತ್ವ೦ ತನ್ಮ॑ಹಿ॒ತ್ವ೦ ಮ॒ಧ್ಯಾ ಕರ್ತೋ॒ರ್ವಿತ॑ತ॒೦ ಸ೦ಜ॑ಭಾರ । 
     ಯ॒ದೇದಯು॑ಕ್ತ ಹ॒ರಿತಃ॑ ಸ॒ದಸ್ಥಾ॒ದಾದ್ರಾತ್ರೀ॒ ವಾಸ॑ಸ್ತನುತೇಸಿ॒ಮಸ್ಮೈ᳚ ॥ 
     ತನ್ಮಿ॒ತ್ರಸ್ಯ॒ ವರು॑ಣಸ್ಯಾಭಿ॒ಚಕ್ಷೇ॒ ಸೂರ್ಯೋ᳚ ರೂ॒ಪ೦ ಕೃ॑ಣುತೇ॒ದ್ಯೋರು॒ಪಸ್ಥೇ᳚ ।
     ಅ॒ನ॒೦ತಮ॒ನ್ಯದ್ರುಶ॑ದಸ್ಯ॒ ಪಾಜಃ॑ ಕೃ॒ಷ್ಣಮ॒ನ್ಯದ್ಧ॒ರಿತಃ॒ ಸ೦ ಭ॑ರ೦ತಿ ॥ 
     ಅ॒ದ್ಯಾ ದೇ᳚ವಾ॒ ಉದಿ॑ತಾ॒ ಸೂರ್ಯ॑ಸ್ಯ॒ ನಿರ೦ಹ॑ಸಃ ಪಿಪೃ॒ತಾ ನಿರ॑ವ॒ದ್ಯಾತ್ । 
     ತನ್ನೋ᳚ ಮಿ॒ತ್ರೋ ವರು॑ಣೋ ಮಾಮಹ೦ತಾ॒ಮದಿ॑ತಿಃ॒ ಸಿ೦ಧುಃ॑ ಪೃಥಿ॒ವೀ ಉ॒ತ ದ್ಯೌಃ ।
    </ವಿನಿಯೋಗ>

  </View>

);
