import React from 'react';
import { View } from 'react-native';

import ಘಟ್ಟವಿನ್ಯಾಸ from '../Ghatta.vinyasa';
import ವಿಷಯ from '../../Vishaya/Vishaya';

export default ದೇವತಾನಮಸ್ಕಾರ = () => (
  <View>
   <ವಿಷಯ ವಿನ್ಯಾಸ = {ಘಟ್ಟವಿನ್ಯಾಸ.ವಿನಿಯೋಗ} >
    ಓ೦ ಸ೦ಧ್ಯಾಯೈ ನಮಃ ।ಓ೦ ಗಾಯತ್ರ್ಯೈ ನಮಃ । 
    ಓ೦ ಸಾವಿತ್ರ್ಯೈ ನಮಃ ।ಓ೦ ಸರಸ್ವತ್ಯೈ ನಮಃ । 
    ಓ೦ ಸರ್ವಾಭ್ಯೋ ದೇವತಾಭ್ಯೋ ನಮಃ ।ಓ೦ ಸರ್ವೇಭ್ಯೋ ದೇವೇಭ್ಯೋ ನಮಃ ।
    ಓ೦ ಋಷಿಭ್ಯೋ ನಮಃ।ಓ೦ ಮುನಿಭ್ಯೋ ನಮಃ। ಓ೦ ಮಾತೃಭ್ಯೋ ನಮಃ । 
    ಓ೦ ಪಿತೃಭ್ಯೋ ನಮಃ । ಓ೦ ಗುರುಭ್ಯೋ ನಮಃ । ಓ೦ ಆಚಾರ್ಯೇಭ್ಯೋ ನಮಃ ।
    ಓ೦ ಕಾಮೋಕಾರ್ಷೀನ್ ಮನ್ಯುರಕಾರ್ಷೀನ್ ನಮೋ ನಮಃ । 
    ಓ೦ ಶಾ೦ತಿ॒ಶ್ಯಾ೦ತಿ॒ಶ್ಯಾ೦ತಿಃ॑ ।ಸರ್ವಶಾ೦ತಿರಸ್ತು ॥
   </ವಿಷಯ>

  </View>

);
