import React from 'react';
import { View } from 'react-native';

import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';
import ಘಟ್ಟವಿನ್ಯಾಸ from '../Ghatta.vinyasa';
import ವಿಷಯ from '../../Vishaya/Vishaya';

export default ಜಾತವೇದಸೇ = () => (
  <View>
    <ವಿಷಯ ವಿನ್ಯಾಸ = {ಘಟ್ಟವಿನ್ಯಾಸ.ಪೂರ್ವಾ೦ಗ} >
      ಜಾತವೇದಸಮಿತಿ ಕಶ್ಯಪೋಜಾತವೇದಾಗ್ನಿಸ್ತ್ರಿಷ್ಟುಪ್ , ಉಪಸ್ಥಾನೇ ವಿನಿಯೋಗಃ ।
    </ವಿಷಯ>
    <ವಿನಿಯೋಗ>
      ಓ೦ ಜಾ॒ತವೇ᳚ದಸೇ ಸುನವಾಮ॒ ಸೋಮ॑ಮರಾತೀ ಯ॒ತೋ ನಿ ದ॑ಹಾತಿ॒ ವೇದಃ॑ । 
      ಸ ನಃ॑ ಪರ್ಷ॒ದತಿ॑ ದು॒ರ್ಗಾಣಿ॒ ವಿಶ್ವಾ᳚ ನಾ॒ವೇವ॒ ಸಿ೦ಧು᳚೦ ದುರಿ॒ತಾತ್ಯ॒ಗ್ನಿಃ ॥ಓ೦ ಶಾ೦ತಿ॒ಶ್ಯಾ೦ತಿ॒ಶ್ಯಾ೦ತಿಃ॑ ।
    </ವಿನಿಯೋಗ>

  </View>

);
