import React from 'react';
import { View } from 'react-native';

import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';

import ವಿಷಯ from '../../Vishaya/Vishaya';

export default ಸಾಯ೦ದಿಶಾನಮಸ್ಕಾರ = () => (
  <View>
    <ವಿನಿಯೋಗ>
      ಓ೦ ನಮಃ ಪ್ರತೀಚ್ಯೇ ದಿಶೇ ವರುಣಾಯ ನಮಃ ವಾಯವೇ ನಮಃ । 
      ಓ೦ ನಮಃ ಉದೀಚ್ಯೇ ದಿಶೇ ಸೋಮಾಯ ನಮಃ ಈಶಾನಾಯ ನಮಃ ।
      ಓ೦ ನಮಃ ಪ್ರಾಚ್ಯೇ ದಿಶೇ ಇ೦ದ್ರಾಯ ನಮಃ ಅಗ್ನಯೇ ನಮಃ । 
      ಓ೦ ನಮಃ ದಕ್ಷಿಣಾಯೈ ದಿಶೇ ಯಮಾಯ ನಮಃ ನಿರ್ಋತಯೇ ನಮಃ । 
      ಓ೦ ಊರ್ಧ್ವಾಯೈ ದಿಶೇ ಬ್ರಹ್ಮಣೇ ನಮಃ । 
      ಓ೦ ಅಧರಾಯೈ ದಿಶೇ ಪೃಥಿವ್ಯೈ ನಮಃ । 
      ಓ೦ ಅವಾ೦ತರಾಯೈ ದಿಶೇ ವಾಯವೇ ನಮಃ ।
    </ವಿನಿಯೋಗ>

  </View>

);
