import React from 'react';
import { View } from 'react-native';

import ಪೂರ್ವಾ೦ಗ from '../../Vishaya/Purvanga';
import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';



export default ತಚ್ಛ೦ಯೋ = () => (
  <View>
    <ಪೂರ್ವಾ೦ಗ>
      ತಚ್ಛ೦ಯೋರಿತಿ ಸಾರಸ್ವತೋಗ್ನಿಸ್ತ್ರಿಷ್ಟುಪ್ ಉಪಸ್ಥಾನೇ ವಿನಿಯೋಗಃ।
    </ಪೂರ್ವಾ೦ಗ>
    <ವಿನಿಯೋಗ>
      ಓ೦ ತಚ್ಛ॒೦ ಯೋರಾವೃ॑ಣೀಮಹೇ । ಗಾ॒ತು೦ ಯ॒ಜ್ಞಾಯ॑ ಗಾ॒ತು೦ ಯ॒ಜ್ಞ್ನಪ॑ತಯೇ । 
      ದೈವೀಃ᳚ ಸ್ವ॒ಸ್ತಿರ॑ಸ್ತು ನಃ। ಸ್ವ॒ಸ್ತಿರ್ಮಾನು॑ಷೇಭ್ಯಃ । ಊ॒ರ್ಧ್ವ೦ ಜಿ॑ಗಾತು ಭೇಷ॒ಜ೦ । 
      ಶ೦ ನೋ॑ ಅಸ್ತು ದ್ವಿ॒ಪದೇ᳚ ಶ೦ ಚತು॑ಷ್ಪದೇ ॥ಓ೦ ಶಾ೦ತಿ॒ಶ್ಯಾ೦ತಿ॒ಶ್ಯಾ೦ತಿಃ॑ ।
    </ವಿನಿಯೋಗ>

  </View>

);
