import React from 'react';
import { View } from 'react-native';

import ಘಟ್ಟವಿನ್ಯಾಸ from '../Ghatta.vinyasa';
import ವಿಷಯ from '../../Vishaya/Vishaya';

export default ತಚ್ಚಕ್ಷುಃ = () => (
  <View>
    <ವಿಷಯ ವಿನ್ಯಾಸ = {ಘಟ್ಟವಿನ್ಯಾಸ.ಪೂರ್ವಾ೦ಗ} >
    ತಚ್ಚಕ್ಷುರಿತಿ ಇತ್ಯಸ್ಯ ಮ೦ತ್ರಸ್ಯ ವಸಿಷ್ಠ ಋಷಿಃ ಸೂರ್ಯೋ ದೇವತಾ ಪುರಉಷ್ಣಿಕ್ ಛ೦ದಃ ಸೂರ್ಯಾವಲೋಕನೇ ವಿನಿಯೋಗಃ ।
    </ವಿಷಯ>
    <ವಿಷಯ ವಿನ್ಯಾಸ = {ಘಟ್ಟವಿನ್ಯಾಸ.ವಿನಿಯೋಗ} >
     ತಚ್ಚಕ್ಷು॑ರ್ದೇ॒ವಹಿ॑ತ೦ ಶು॒ಕ್ರಮು॒ಚ್ಚರ॑ತ್ । ಪಶ್ಯೇ᳚ಮ ಶ॒ರದಃ॑ ಶ॒ತ೦ ಜೀವೇ᳚ಮ ಶ॒ರದಃ॑ ಶ॒ತಮ್।
    </ವಿಷಯ>

  </View>

);
