import React from 'react';
import { View } from 'react-native';

import ಘಟ್ಟವಿನ್ಯಾಸ from '../Ghatta.vinyasa';
import ವಿಷಯ from '../../Vishaya/Vishaya';

export default ಉದುತ್ಯ೦ = () => (
  <View>
    <ವಿಷಯ ವಿನ್ಯಾಸ = {ಘಟ್ಟವಿನ್ಯಾಸ.ಪೂರ್ವಾ೦ಗ} >
    ಉದುತ್ಯ೦ ಜಾತವೇದಸಮಿತಿ ತ್ರಯೋದಶರ್ಚಸ್ಯ ಸೂಕ್ತಸ್ಯ
    ಕಣ್ವ ಪುತ್ರಃ ಪ್ರಸ್ಕಣ್ವ ಋಷಿಃ ಸೂರ್ಯೋ ದೇವತಾ
    ನವಾದ್ಯಾ ಗಾಯತ್ರೀ ಛ೦ದಃ ಚತಸ್ರೋಽನುಷ್ಟುಭಃ ಉದ್ವಯ೦ ತಮಸಸ್ಪರೀತಿ
    ಉದ್ದ್ಯನ್ನದ್ಯೇತ್ಯಯ೦ ತೃಚಃ ರೋಗಘ್ನ ಉಪನಿಷದ೦ತ್ಯೋ ಅರ್ಧರ್ಚಷಃ ದ್ವಿಷನ್ನಾಶಿನೀ
    ಸೂರ್ಯೋಪಸ್ಥಾನೇ ವಿನಿಯೋಗಃ ।
    </ವಿಷಯ>
    <ವಿಷಯ ವಿನ್ಯಾಸ = {ಘಟ್ಟವಿನ್ಯಾಸ.ವಿನಿಯೋಗ} >
     ಓ೦ ಉದು॒ತ್ಯ೦ ಜಾ॒ತವೇ᳚ದಸ೦ ದೇ॒ವ೦ ವ॑ಹನ್ತಿ ಕೇ॒ತವಃ॑ । ದೃ॒ಶೇ ವಿಶ್ವಾ᳚ಯ॒ ಸೂರ್ಯಮ್᳚॥ 
     ಅಪ॒ ತ್ಯೇ ತಾ॒ಯವೋ᳚ ಯಥಾ॒ ನಕ್ಷ॑ತ್ರಾಯನ್ತ್ಯ॒ಕ್ತುಭಿಃ॑। ಸೂರಾ᳚ಯ ವಿ॒ಶ್ವ ಚ॑ಕ್ಷಸೇ॥ 
     ಅದೃ॑ಶ್ರಮಸ್ಯಕೇ॒ತವೋ॒ ವಿ ರ॒ಶ್ಮಯೋ॒ ಜನಾ॒ँ ಅನು॑ । ಭ್ರಾಜ᳚ನ್ತೋ ಅ॒ಗ್ನಯೋ᳚ ಯಥಾ॥ 
     ತ॒ರಣಿ᳚ರ್ವಿ॒ಶ್ವದ॑ರ್ಶತೋ ಜ್ಯೋತಿ॒ಷ್ಕೃದ॑ಸಿ ಸೂರ್ಯ। ವಿಶ್ವ॒ಮಾಭಾ᳚ಸಿ ರೋಚ॒ನಮ್॥ 
     ಪ್ರ॒ತ್ಯಙದೇ॒ವಾನಾ॒೦ ವಿಶಃ॑ ಪ್ರ॒ತ್ಯಙ್ಙುದೇ᳚ಷಿ॒ಮಾನು॑ಷಾನ್ । ಪ್ರ॒ತ್ಯಙ್ವಿಶ್ವ॒೦ ಸ್ವ॑ರ್ದೃ॒ಶೇ॥ 
     ಯೇನಾ᳚ ಪಾವಕ॒ ಚಕ್ಷ॑ಸಾ ಭುರ॒ಣ್ಯ೦ತ॒೦ ಜನಾ॒ँ ಅನು॑ । ತ್ವ೦ ವ॑ರುಣ॒ ಪಶ್ಯ॑ಸಿ॥
     ವಿದ್ಯಾಮೇ᳚ಷಿ॒ ರಜ॑ಸ್ಪೃ॒ಥ್ವಹಾ॒ ಮಿಮಾ᳚ನೋ ಅ॒ಕ್ತುಭಿಃ॑ । ಪಶ್ಯ॒ಞ್ಜನ್ಮಾ᳚ನಿ ಸೂರ್ಯ॥
     ಸ॒ಪ್ತ ತ್ವಾ᳚ ಹ॒ರಿತೋ॒ ರಥೇ॒ ವಹ᳚ನ್ತಿ ದೇವ ಸೂರ್ಯ । ಶೋ॒ಚಿಷ್ಕೇ᳚ಶ೦ ವಿಚಕ್ಷಣ ॥
     ಅಯು॑ಕ್ತ ಸ॒ಪ್ತಶು॒ನ್ಧ್ಯುವಃ॒ ಸೂರೋ॒ರಥ॑ಸ್ಯ ನ॒ಪ್ತ್ಯಃ॑ । ತಾಭಿ᳚ರ್ಯಾತಿ॒ ಸ್ವಯು॑ಕ್ತಿಭಿಃ ॥
     ಉದ್ವ॒ಯ೦ತಮ॑ಸ॒ಸ್ಪರಿ॒ ಜ್ಯೋತಿ॒ಷ್ಪಶ್ಯ᳚೦ತ॒ ಉತ್ತ॑ರಮ್ । ದೇ॒ವ೦ ದೇ᳚ವ॒ತ್ರಾ ಸೂರ್ಯ॒ಮಗ᳚ನ್ಮ॒ ಜ್ಯೋತಿ॑ರುತ್ತ॒ಮಮ್ ॥ 
     ಉ॒ದ್ಯನ್ನ॒ದ್ಯ ಮಿ॑ತ್ರಮಹ ಆ॒ರೋಹ॒ನ್ನುತ್ತ॑ರಾ॒೦ ದಿವಮ್᳚ । ಹೃ॒ದ್ರೋ॒ಗ೦ ಮಮ॑ ಸೂರ್ಯ ಹರಿ॒ಮಾಣ᳚೦ ಚ ನಾಶಯ ॥
     ಶುಕೇ᳚ಷು ಮೇ ಹರಿ॒ಮಾಣ᳚೦ ರೋಪ॒ಣಾಕಾ᳚ಸು ದಧ್ಮಸಿ । ಅಥೋ᳚ ಹಾರಿದ್ರ॒ವೇಷು॑ ಮೇ ಹರಿ॒ಮಾಣ॒೦ ನಿ ದ॑ಧ್ಮಸಿ ॥
     ಉದ॑ಗಾದ॒ಯಮಾ᳚ದಿತ್ಯೋ ವಿಶ್ವೇ᳚ ನ॒ ಸಹ॑ಸಾ ಸ॒ಹ । ದ್ವಿ॒ಷ೦ತ॒೦ ಮಹ್ಯ᳚೦ ರ॒ನ್ಧಯ॒ನ್ಮೋ ಅ॒ಹ೦ ದ್ವಿ॑ಷ॒ತೇ ರ॑ಧಮ್॥
    </ವಿಷಯ>

  </View>

);
