import React from 'react';

import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';
import ಪೂರ್ವೋತ್ತರ from '../../Vishaya/Purvanga';
import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';
import ಆವರಣ from '../../Avarana/Avarana';
import ವಿಧಾನ from '../../Vishaya/Vidhana';

export default ಸ೦ಕಲ್ಪ = () => (
  <ಆವರಣ>
    <ಶೀರ್ಷಿಕೆ>
      ಸ೦ಕಲ್ಪ
    </ಶೀರ್ಷಿಕೆ>
    <ಪೂರ್ವೋತ್ತರ>
      ಪ್ರಣವಸ್ಯ ಪರಬ್ರಹ್ಮ ಋಷಿಃ ಪರಮಾತ್ಮಾ ದೇವತಾ ದೈವೀ ಗಾಯತ್ರೀ ಛ೦ದಃ ಪ್ರಾಣಾಯಾಮೇ ವಿನಿಯೋಗಃ ।
    </ಪೂರ್ವೋತ್ತರ>
    <ವಿನಿಯೋಗ>
      ಓ೦ ಭೂಃ ಓ೦ ಭುವಃ ಓ೦ ಸುವಃ ಓ೦ ಮಹಃ ಓ೦ ಜನಃ ಓ೦ ತಪಃ ಓ೦ ಸತ್ಯಮ್ ॥
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ>
      ಓ೦ ತತ್ಸ॑ವಿ॒ತುರ್ವರೇ᳚ಣ್ಯ॒೦ ಭರ್ಗೋ᳚ ದೇ॒ವಸ್ಯ॑ ಧೀಮಹಿ । ಧಿಯೋ॒ ಯೋ ನಃ॑ ಪ್ರಚೋ॒ದಯಾ᳚ತ್ ॥
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ>
      ಓ॒ಮಾಪೋ॒ ಜ್ಯೋತೀ॒ರಸೋ॒ಽಮೃತ॒೦ ಬ್ರಹ್ಮ॒ ಭೂರ್ಭುವ॒ಸ್ಸ್ವರೋ೦॥
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ>
      ಶುಭಾಭ್ಯಾ೦, ಶೋಭನೇ ಮುಹೂರ್ತೇ, ಅದ್ಯ ಬ್ರಹ್ಮಣಃ, ದ್ವಿತೀಯ ಪರಾರ್ಧೇ, ಶ್ವೇತವರಾಹ ಕಲ್ಪೇ,
      ವೈವಸ್ವತ ಮನ್ವಂತರೇ, ಕಲಿಯುಗೇ, ಪ್ರಥಮ ಪಾದೇ, ಜಂಬೂದ್ವೀಪೇ, ಭರತವರ್ಷೇ, ಭರತಖಂಡೇ,
      ಶಾಲೀವಾಹನಶಕೇ, ಅಸ್ಮಿನ್ ವರ್ತಮಾನೇ, ವ್ಯಾವಹಾರಿಕೇ, ಚಾಂದ್ರಮಾನೇನ,
      ಪ್ರಭವಾದಿ ಷಷ್ಟ್ಯಾಃ ಸಂವತ್ಸರಾಣಾಂ ಮಧ್ಯೇ,
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ>
      ಶ್ರೀ … ನಾಮ ಸಂವತ್ಸರೇ …… ಅಯನೇ ……… ಋತೌ …… ಮಾಸೇ …… ಪಕ್ಷೇ ……
      ತಿಥೌ …… ವಾಸರಯುಕ್ತಾಯಾ೦ ಶುಭನಕ್ಷತ್ರ ಶುಭಯೊಗ ಶುಭಕರಣ
      ಏವ೦ಗುಣ ವಿಷೇಷಣ ವಿಶಿಷ್ಟಾಯಾಂ ಶುಭತಿಥೌ ।
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ>
      ಮಮ ಉಪಾತ್ತ ಸಮಸ್ತ ದುರಿತಕ್ಷಯದ್ವಾರಾ ಶ್ರೀ ಪರಮೇಶ್ವರ ಪ್ರೀತ್ಯರ್ಥ೦ 
      ಅಸ್ಮಾಕಂ ಸಹ ಕುಟು೦ಬಾನಾ೦ ಕ್ಷೇಮ-ಸ್ಥೈರ್ಯ-ವಿಜಯ-ವೀರ್ಯ, 
      ಆಯುಃ-ಆರೋಗ್ಯ-ಐಶ್ವರ್ಯ-ಅಭಿವೃದ್ಧ್ಯರ್ಥ೦, ಧರ್ಮ-ಅರ್ಥ-ಕಾಮ-ಮೋಕ್ಷ 
      ಚತುರ್ವಿಧ ಫಲ ಪುರುಷಾರ್ಥ ಸಿಧ್ದ್ಯರ್ಥ೦, ಇಷ್ಟ ದೇವತಾ ಪ್ರೀತ್ಯರ್ಥಂ, 
      ಯಾವಚ್ಛಕ್ತಿ ಧ್ಯಾನಾವಾಹನಾದಿ ಷೋಢಶೋಪಚಾರ ಪೂಜಾ೦ ಕರಿಷ್ಯೇ ।।
    </ವಿನಿಯೋಗ>
     
  </ಆವರಣ>

);
