import React from 'react';

import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';
import ಪೂರ್ವೋತ್ತರ from '../../Vishaya/Purvanga';
import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';
import ಆವರಣ from '../../Avarana/Avarana';
import ವಿಧಾನ from '../../Vishaya/Vidhana';

export default ಆಸನವಿಧಿ = () => (
    <ಆವರಣ>
    <ಶೀರ್ಷಿಕೆ>
       ಆಸನವಿಧಿ
    </ಶೀರ್ಷಿಕೆ>
    <ಪೂರ್ವೋತ್ತರ >
      ಪೃಥಿವ್ಯಾ೦ ಮೇರು ಪೃಷ್ಠ ಋಷಿಃ । ಸುತಲಂ ಛಂದಃ । ಆದಿ ಕೂರ್ಮೋ ದೇವತಾ । ಆಸನೇ ವಿನಿಯೋಗಃ ॥
    </ಪೂರ್ವೋತ್ತರ>
    <ವಿನಿಯೋಗ >
     ಪೃಥ್ವಿ ತ್ವಯಾ ಧೃತಾ ಲೋಕಾ ದೇವಿ ತ್ವಂ ವಿಷ್ಣುನಾ ಧೃತಾ । ತ್ವಂ ಚ ಧಾರಯ ಮಾಂ ದೇವಿ ಪವಿತ್ರಂ ಕುರುಚಾಸನಂ ॥
    </ವಿನಿಯೋಗ>
    <ವಿಧಾನ>
     (ಶುಧ್ದಾಸನದಲ್ಲಿ ಕುಳಿತುಕೊಳ್ಳುವುದು.ಒ೦ದು ಉದ್ಧರಣೆ ನೀರನ್ನು ಕುಳಿತಿರುವ ಆಸನದ ಕೆಳಗೆ ಪ್ರೋಕ್ಷಿಸುವುದು.)
    </ವಿಧಾನ>

    </ಆವರಣ>
);
