import React from 'react';


import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';


export default ಆವಾಹನ = () => (

  <ವಿನಿಯೋಗ>
    ಆಗಚ್ಛ ವರದೇ ದೇವೀ ಜಪ್ಯೇಮೇ ಸನ್ನಿಧೌ ಭವ । ಗಾಯ೦ತ೦ ತ್ರಾಯಸೇ ಯಸ್ಮಾತ್ ಗಾಯತ್ರೀ೦ ತ್ವಮತಸ್ಮೃತ ।
    ಗಾಯತ್ರಿಯಾ ಗಾಥಿನೋ ವಿಶ್ವಾಮಿತ್ರ ಋಷಿಃ, ಸವಿತಾ ದೇವತಾ, ಗಾಯತ್ರೀ ಛ೦ದಃ।
    ಅರ್ಗ್ನಿಮುಖ೦, ಬ್ರಹ್ಮಾ ಶಿರಃ, ವಿಷ್ಣುರ್ಹೃದಯ೦, ರುದ್ರಃಶಿಖಾ, ಪೃಥ್ವೀಯೋನಿ, ಪ್ರಾಣಾಪಾನ, ವ್ಯಾನೋದಾನ,
    ಸ ಮಾನಾ ಸ ಪ್ರಾಣಾ, ಶ್ವೇತ ವರ್ಣಾ, ಸಾ೦ಖ್ಯಾಯನಸ ಗೋತ್ರಾ, ಗಾಯತ್ರೀ ಚತುರ್ವಿ೦ಶತ್ಯಕ್ಷರಾ ,
    ತ್ರಿಪದಾ ಷಟ್ಕುಕ್ಷಿಃ, ಪ೦ಚಶೀರ್ಷೋಪನಯನೇ ವಿನಿಯೋಗಃ ।
  </ವಿನಿಯೋಗ>


);
