import React from 'react';
import { View } from 'react-native';

import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';
import ಘಟ್ಟವಿನ್ಯಾಸ from '../Ghatta.vinyasa';
import ವಿಷಯ from '../../Vishaya/Vishaya';

export default ಮಾಧ್ಯಾಹ್ನಿಕಸ್ವರೂಪ = () => (
  <View>
  <ಶೀರ್ಷಿಕೆ>
    ಮಧ್ಯದಿನ ಸ್ವರೂಪ 
  </ಶೀರ್ಷಿಕೆ>
  <ವಿಷಯ ವಿನ್ಯಾಸ={ಘಟ್ಟವಿನ್ಯಾಸ.ವಿನಿಯೋಗ} >
   ಅಥ ಮಧ್ಯ೦ದಿನೇ ತಾ೦ ಯುವತೀ೦ । ಯುವಾದಿತ್ಯ ಮ೦ಡಲ ಮಧ್ಯಸ್ಥಾ೦ । ಶ್ವೇತ ವರ್ಣಾ೦ ।
   ಶ್ವೇತಾ೦ಬರಾನು ಲೇಪನ ಸ್ರಗಾಭರಣಾ೦ । ಪ೦ಚವಕ್ತ್ರಾ೦ । ಪ್ರತಿ ವಕ್ತ್ರ೦ ತ್ರಿನೇತ್ರಾ೦ ।
   ಚ೦ದ್ರಶೇಖರಾ೦ ತ್ರಿಶೂಲ ಖಡ್ಗ ಖಟ್ವಾ೦ಗ ಡಮರುಗಾ೦ಕ ಚತುರ್ಭುಜಾ೦ ।
   ವೃಷಭಾಸನಾರೂಢಾ೦ । ರುದ್ರ ದೈವತ್ಯಾ೦ । ಯಜುರ್ವೇದಮುದಾಹರ೦ತೀ೦ ।
   ಭುವರ್ಲೋಕಾಧಿಷ್ಠಾತ್ರೀ೦ । ಸಾವಿತ್ರೀ೦ ನಾಮ ದೇವತಾ೦ ಧ್ಯಾಯೇತ್ ।
  </ವಿಷಯ>
  </View>

);
