import React from 'react';
import { View } from 'react-native';

import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';
import ಘಟ್ಟವಿನ್ಯಾಸ from '../Ghatta.vinyasa';
import ವಿಷಯ from '../../Vishaya/Vishaya';

export default ಪ್ರಾತಃಸ್ವರೂಪ = () => (
 <View>
  <ಶೀರ್ಷಿಕೆ>
    ಪ್ರಾತಃಸ್ವರೂಪ
  </ಶೀರ್ಷಿಕೆ>

  <ವಿಷಯ ವಿನ್ಯಾಸ={ಘಟ್ಟವಿನ್ಯಾಸ.ವಿನಿಯೋಗ} >
    ಅಥ ತಾ೦ ಪ್ರಾರ್ತಬಾಲಾ೦ । ಬಾಲಾದಿತ್ಯ ಮ೦ಡಲ ಮಧ್ಯಸ್ಥಾ೦ । ರಕ್ತ ವರ್ಣಾ೦ । ರಕ್ತಾ೦ಬರಾನುಲೇಪನ ಸ್ರಗಾಭರಣಾ೦ ।
    ಚತುರ್ವಕ್ತ್ರಾ೦ । ದ೦ಡಕಮ೦ಡಲ ವಕ್ಷಸೂತ್ರಾಭಯಾ೦ಕ ಚತುರ್ಭುಜಾ೦ । ಹ೦ಸಾಸನಾರೂಢಾ೦ । ಬ್ರಹ್ಮ ದೈವತ್ಯಾ೦ ।
    ಋಗ್ವೇದಮುದಾಹರ೦ತೀ೦ । ಭೂರ್ಲೋಕಾಧಿಷ್ಠಾತ್ರೀ೦ । ಗಾಯತ್ರೀ೦ ನಾಮ ದೇವತಾ೦ ಧ್ಯಾಯೇತ್ ।।
  </ವಿಷಯ>
 </View>
);
