import React from 'react';
import { View } from 'react-native';

import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';
import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';



export default ಸಾಯ೦ಸ್ವರೂಪ = () => (
  <View>
  <ಶೀರ್ಷಿಕೆ>
   ಸಾಯ೦ಸ್ವರೂಪ
  </ಶೀರ್ಷಿಕೆ>

  <ವಿನಿಯೋಗ>
  ಅಥ ತಾ೦ ಸಾಯ೦ ವೃದ್ಧಾ೦ । ವೃದ್ಧಾದಿತ್ಯ ಮ೦ಡಲ ಮಧ್ಯಸ್ಥಾ೦ । 
  ಶ್ಯಾಮ ವರ್ಣಾ೦ ಶ್ಯಾಮಾ೦ಬರಾನು ಲೇಪನ ಸ್ರಗಾಭರಣಾ೦ । 
  ಏಕವಕ್ತ್ರಾ೦ ಶ೦ಖ ಚಕ್ರ ಗದಾ ಪದ್ಮಾ೦ಕ ಚತುರ್ಭುಜಾ೦ ।
  ಗರುಡಾಸನಾ ರೂಢಾ೦ ವಿಷ್ಣು ದೈವತ್ಯಾ೦ ।
  ಸಾಮವೇದಮುದಾಹರ೦ತೀ೦ ಸುವರ್ಲೋಕಾಧಿಷ್ಠಾತ್ರೀ೦ ।
  ಸರಸ್ವತೀ೦ ನಾಮ ದೇವತಾ೦ ಧ್ಯಾಯೇತ್ ।
  </ವಿನಿಯೋಗ>
  </View>

);
