import React from 'react';
import { View } from 'react-native';

import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';
import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';

export default ಆಚಮನೀಯ = () => (
  <View>
    <ಶೀರ್ಷಿಕೆ>
      ಆಚಮನೀಯ
    </ಶೀರ್ಷಿಕೆ>
    <ವಿನಿಯೋಗ >
      ಕೇಶವಾಯ ಸ್ವಾಹಾ । ನಾರಾಯಣಾಯ ಸ್ವಾಹಾ ।ಮಾಧವಾಯ ಸ್ವಾಹಾ । ಗೋವಿ೦ದಾಯ ನಮಃ ॥
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ >
      ವಿಷ್ಣವೇ ನಮಃ । ಮಧುಸೂದನಾಯ ನಮಃ । ತ್ರಿವಿಕ್ರಮಾಯ ನಮಃ । ವಾಮನಾಯ ನಮಃ ।ಶ್ರೀಧರಾಯ ನಮಃ ।
      ಹೃಷೀಕೇಶಾಯ ನಮಃ । ಪದ್ಮನಾಭಾಯ ನಮಃ । ದಾಮೋದರಾಯ ನಮಃ । ಸ೦ಕರ್ಷಣಾಯ ನಮಃ। 
      ವಾಸುದೇವಾಯ ನಮಃ । ಪ್ರದ್ಯುಮ್ನಾಯ ನಮಃ । ಅನಿರುದ್ಧಾಯ ನಮಃ । ಪುರುಷೋತ್ತಮಾಯ ನಮಃ । 
      ಅಧೋಕ್ಷಜಾಯ ನಮಃ । ನಾರಸಿ೦ಹಾಯ ನಮಃ । ಅಚ್ಯುತಾಯ ನಮಃ । ಜನಾರ್ದನಾಯ ನಮಃ । 
      ಉಪೇ೦ದ್ರಾಯ ನಮಃ । ಹರಯೇ ನಮಃ । ಶ್ರೀ ಕೃಷ್ಣಾಯ ನಮಃ ॥
    </ವಿನಿಯೋಗ>

  </View>

);
