import React from 'react';
import { View, Text } from 'react-native';

import ಘಟ್ಟವಿನ್ಯಾಸ from '../Ghatta.vinyasa';
import ವಿಷಯ from '../../Vishaya/Vishaya';

export default  ಆಕೃಷ್ಣೇನ = () => (
<View>

<ವಿಷಯ ವಿನ್ಯಾಸ = {ಘಟ್ಟವಿನ್ಯಾಸ.ಪೂರ್ವಾ೦ಗ}>
ಆಕೃಷ್ಣೇನ ರಜಸಾ ಹಿರಣ್ಯಸ್ತೂಪಃ ಸವಿತಾ ತ್ರಿಷ್ಟುಪ್ ಅರ್ಘ್ಯ ಪ್ರದಾನೇ ವಿನಿಯೋಗಃ ।
</ವಿಷಯ>

<ವಿಷಯ ವಿನ್ಯಾಸ = {ಘಟ್ಟವಿನ್ಯಾಸ.ವಿನಿಯೋಗ}>
  ಆಕೃ॒ಷ್ಣೇನ॒ ರಜ॑ಸಾ॒ ವರ್ತ॑ಮಾನೋ ನಿವೇ॒ಶಯ॑ನ್ನ॒ಮೃತ॒೦ ಮರ್ತ್ಯ᳚೦ ಚ । ಹಿ॒ರ॒ಣ್ಯಯೇ᳚ನ ಸವಿ॒ತಾ ರಥೇ॒ನಾಽಽದೇ॒ವೋ ಯಾ᳚ತಿ॒ ಭುವ॑ನಾನಿ॒ಪಶ್ಯನ್॑ ।
</ವಿಷಯ>

</View>

);
