import React from 'react';

import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';
import ಪೂರ್ವಾ೦ಗ from '../../Vishaya/Purvanga';
import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';
import ಆವರಣ from '../../Avarana/Avarana';
import ವಿಧಾನ from '../../Vishaya/Vidhana';

export default ಅಪರಾಧಕ್ಷಮಾಪಣ = () => (
    <ಆವರಣ>
    <ಶೀರ್ಷಿಕೆ>
    ಅಪರಾಧಕ್ಷಮಾಪಣ
    </ಶೀರ್ಷಿಕೆ>
    <ವಿನಿಯೋಗ >
    ಆವಾಹನಂ ನ ಜಾನಾಮಿ ನ ಜಾನಾಮಿ ವಿಸರ್ಜನ೦ ।
    ಪೂಜಾವಿಧಿ೦ ನ ಜಾನಾಮಿ ಕ್ಷಮಸ್ವ ಪರಮೇಶ್ವರ / ಪುರುಷೋತ್ತಮ/ ಪರಮೇಶ್ವರಿ ॥
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ >
    ಅಪರಾಧಸಹಸ್ರಾಣಿ ಕ್ರಿಯಂತೇಽಹರ್ನಿಶಂ ಮಯಾ ।
    ದಾಸೋಽಯಮಿತಿ ಮಾಂ ಮತ್ವಾ ಕ್ಷಮಸ್ವ ಪರಮೇಶ್ವರ / ಪುರುಷೋತ್ತಮ/ ಪರಮೇಶ್ವರಿ ॥
    </ವಿನಿಯೋಗ>
    <ಪೂರ್ವಾ೦ಗ>
     ಅನೇನ ಮಯಾ ಕೃತ ಧ್ಯಾನಾವಾಹನಾದಿ ಪೂಜನೇನ ಇಷ್ಟ ದೇವತಾಃ ಸುಪ್ರೀತಾಃ ಸುಪ್ರಸನ್ನಾಃ ವರದಾಃ ಭವ೦ತು ॥
    </ಪೂರ್ವಾ೦ಗ>
    <ಪೂರ್ವಾ೦ಗ>
     ಪೂಜಾಕಾಲೇ ಮಧ್ಯೇ ಮ೦ತ್ರ ತ೦ತ್ರ ಸ್ವರ ವರ್ಣ ಧ್ಯಾನ ನಿಯಮ ಲೋಪ ದೋಷ ಪ್ರಾಯಶ್ಚಿತ್ತಾರ್ಥ೦
     ನಾಮತ್ರಯ ಮಹಾ ಮ೦ತ್ರ ಜಪ೦ ಕರಿಷ್ಯೇ ।
   </ಪೂರ್ವಾ೦ಗ>
   <ವಿನಿಯೋಗ>
    ಅಚ್ಯುತಾಯ ನಮಃ । ಅನ೦ತಾಯ ನಮಃ । ಗೋವಿ೦ದಾಯ ನಮಃ । ಅಚ್ಯುತಾನ೦ತಗೋವಿ೦ದೇಭ್ಯೋ ನಮಃ ।
   </ವಿನಿಯೋಗ>
   <ವಿನಿಯೋಗ>
    (ಮೂರು ಬಾರಿ)
   </ವಿನಿಯೋಗ>
   <ವಿನಿಯೋಗ>
    ಕಾಯೇನ ವಾಚ ಮನಸೇ೦ದ್ರಿಯೈರ್ವಾ ಬುಧ್ಧ್ಯಾತ್ಮನಾವಾ ಪ್ರಕೃತೇಸ್ಸ್ವಭಾವಾತ್ । 
    ಕರೋಮಿ ಯದ್ಯತ್ ಸಕಲ೦ ಪರಸ್ಮ್ಯೆ ಶ್ರೀಮನ್ನಾರಯಣಾಯೇತಿ ಸಮರ್ಪಯಾಮಿ ।
   </ವಿನಿಯೋಗ>
   <ವಿನಿಯೋಗ>
    ಓ೦ ಶಾ೦ತಿ॒ಶ್ಯಾ೦ತಿ॒ಶ್ಯಾ೦ತಿಃ॑ । ಹರಿಃ ಓ೦ ತತ್ಸತ್ । ತತ್ಸಬ್ರಹ್ಮಾರ್ಪಣಮಸ್ತು ॥
   </ವಿನಿಯೋಗ>


    </ಆವರಣ>
);
