import React from 'react';

import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';
import ಪೂರ್ವಾ೦ಗ from '../../Vishaya/Purvanga';
import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';
import ಆವರಣ from '../../Avarana/Avarana';
import ವಿಧಾನ from '../../Vishaya/Vidhana';

export default ಶ೦ಖಪೂಜಾ = () => (
    <ಆವರಣ>
    <ಶೀರ್ಷಿಕೆ>
      ಶ೦ಖಪೂಜಾ
    </ಶೀರ್ಷಿಕೆ>
    <ವಿಧಾನ>
      ಕಲಶೋದಕೇನ ಶಂಖಂ ಪ್ರಕ್ಷಾಳ್ಯ । ಶಂಖಂ ಗಂಧಾಕ್ಷತ ಪತ್ರ ಪುಷ್ಪೈಃ ಅಭ್ಯರ್ಚ್ಯ । ಪ್ರಣವೇನ ಶಂಖಮಾಪೂರ್ಯ ॥
    </ವಿಧಾನ>
    <ವಿನಿಯೋಗ >
      ಶಂಖಂ ಚಂದ್ರಾರ್ಕದೈವತ್ಯಂ ವಾರುಣ೦ ಚಾಧಿದೈವತ೦ । ಪೃಷ್ಠೇ ಪ್ರಜಾಪತಿಸ್ತತ್ರ  ಅಗ್ರೇ ಗಂಗಾ ಸರಸ್ವತೀ ॥
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ >
      ತ್ರೈಲೋಕ್ಯೇ ಯಾನಿ ತೀರ್ಥಾನಿ ವಾಸುದೇವಸ್ಯ ಚಾಜ್ಞಯಾ । ಶಂಖೇ ತಿಷ್ಠಂತಿ ವಿಪ್ರೇ೦ದ್ರ ತಸ್ಮಾಚ್ಛಂಖಂ ಪ್ರಪೂಜಯೇತ್ ॥
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ >
      ತ್ವಂ ಪುರಾ ಸಾಗರೋತ್ಪನ್ನೋ ವಿಷ್ಣುನಾ ವಿಧೃತಃ ಕರೇ । ಪೂಜಿತಃ ಸರ್ವದೇವೈಶ್ಚ ಪಾಂಚಜನ್ಯ ನಮೋಽಸ್ತುತೇ ॥
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ >
      ಪಾಂ॒ಚ॒ಜ॒ನ್ಯಾಯ॑  ವಿ॒ದ್ಮಹೇ॑ ಪಾವಮಾ॒ನಾಯ॑ ಧೀಮಹಿ ।  ತನ್ನಃ॑ ಶಂಖಃ : ಪ್ರಚೋ॒ದಯಾ᳚ತ್ ॥
    </ವಿನಿಯೋಗ>
    <ವಿಧಾನ>
     ಶಂಖೋದಕಂ ಕಲಶೇ ಕಿ೦ಚಿನ್ನಿಕ್ಷಿಪ್ಯ । ಪುನಃ ಶಂಖಮಾಪುರ್ಯ । 
     ಶ೦ಖೋದಕೇನ ಪೂಜಾದ್ರವ್ಯಾಣಿ ದೇವಂ ಆತ್ಮಾನಂಚ ಪ್ರೋಕ್ಷ್ಯ  । ಶೇಷಂ ವಿಸೃಜ್ಯ । 
     ಪುನಃ ಶಂಖಮಾಪೂರ್ಯ ॥
    </ವಿಧಾನ>

    </ಆವರಣ>
);
