import React from 'react';

import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';
import ಪೂರ್ವಾ೦ಗ from '../../Vishaya/Purvanga';
import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';
import ಆವರಣ from '../../Avarana/Avarana';
import ವಿಧಾನ from '../../Vishaya/Vidhana';

export default ಮಹಾಗಣಪತಿಪ್ರಾರ್ಥನೆ = () => (
    <ಆವರಣ>
    <ಶೀರ್ಷಿಕೆ>
      ಮಹಾಗಣಪತಿ ಪ್ರಾರ್ಥನೆ
    </ಶೀರ್ಷಿಕೆ>
    <ಪೂರ್ವಾ೦ಗ >
      ಆದೌ ನಿರ್ವಿಘ್ನತಾ ಸಿದ್ಧ್ಯರ್ಥಂ ಶ್ರೀ ಮಹಾಗಣಪತಿ ಪ್ರಾರ್ಥನಾ೦ ಕರಿಷ್ಯೇ ॥
    </ಪೂರ್ವಾ೦ಗ>
    <ವಿನಿಯೋಗ >
     ಗ॒ಣಾನಾ᳚೦ ತ್ವಾ ಗ॒ಣಪ॑ತಿಗ್೦ ಹವಾಮಹೇ ಕ॒ವಿ೦  ಕ॑ವೀ॒ನಾಮು॑ಪ॒ಮಶ್ರ॑ವಸ್ತಮ೦ ।
     ಜ್ಯೇ॒ಷ್ಠ॒ರಾಜ॒೦ ಬ್ರಹ್ಮ॑ಣಾ೦ ಬ್ರಹ್ಮಣಸ್ಪತ॒ ಆ ನಃ॑ ಶೃ॑ಣ್ವನ್ನೂ॒ತಿಭಿ॑ಸ್ಸೀದ॒ ಸಾದ॑ನ೦॥
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ >
     ವಕ್ರತುಂಡ ಮಹಾಕಾಯ ಕೋಟಿ ಸೂರ್ಯ ಸಮಪ್ರಭ । ನಿರ್ವಿಘ್ನಂ ಕುರು ಮೇ ದೇವ ಸರ್ವ ಕಾರ್ಯೇಷು ಸರ್ವದಾ ॥
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ >
     ಓಂ ಸುಮುಖಾಯ ನಮಃ । ಏಕದಂತಾಯ ನಮಃ । ಕಪಿಲಾಯ ನಮಃ । ಗಜಕರ್ಣಕಾಯ ನಮಃ ॥ 
     ಲ೦ಬೋದರಾಯ ನಮಃ । ವಿಕಟಾಯ ನಮಃ । ವಿಘ್ನರಾಜಾಯ ನಮಃ । ಗಣಾಧಿಪಾಯ ನಮಃ ॥ 
     ಧೂಮ್ರಕೇತವೇ ನಮಃ । ಗಣಾಧ್ಯಕ್ಷಾಯ ನಮಃ । ಫಾಲಚ೦ದ್ರಾಯ ನಮಃ । ಗಜಾನನಾಯ ನಮಃ ॥
    </ವಿನಿಯೋಗ>
    <ಪೂರ್ವಾ೦ಗ >
      ಇತಿ ಶ್ರೀ ಮಹಾಗಣಪತಿ ಪ್ರಾರ್ಥನಾ೦ ಸಮರ್ಪಯಾಮಿ ॥
    </ಪೂರ್ವಾ೦ಗ>
    </ಆವರಣ>
);
