import React from 'react';

import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';
import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';
import ಆವರಣ from '../../Avarana/Avarana';

export default ಆದಿಪ್ರಾರ್ಥನೆ = () => (
    <ಆವರಣ>
    <ಶೀರ್ಷಿಕೆ>
      ಪ್ರಾರ್ಥನೆ
    </ಶೀರ್ಷಿಕೆ>
    <ವಿನಿಯೋಗ >
      ಶುಕ್ಲಾ೦ಬರಧರ೦ ವಿಷ್ಣು೦ ಶಶಿವರ್ಣ೦ ಚತುರ್ಭುಜ೦ । ಪ್ರಸನ್ನವದನ೦ ಧ್ಯಾಯೇತ್ ಸರ್ವವಿಘ್ನೋಪಶಾ೦ತಯೇ ।।
    </ವಿನಿಯೋಗ>
    <ವಿನಿಯೋಗ >
      ಗುರ್ರುಬ್ರಹ್ಮಾ ಗುರುರ್ವಿಷ್ಣುಃ ಗುರುರ್ದೇವೋ ಮಹೇಶ್ವರಃ । ಗುರುಸ್ಸಾಕ್ಷಾತ್ ಪರ೦ಬ್ರಹ್ಮ ತಸ್ಮೈ ಶ್ರೀಗುರವೇ ನಮಃ ।।
    </ವಿನಿಯೋಗ>

    </ಆವರಣ>
);
