import React from 'react';
import { View } from 'react-native';

import ಘಟ್ಟವಿನ್ಯಾಸ from '../Ghatta.vinyasa';
import ವಿಷಯ from '../../Vishaya/Vishaya';

export default ಯಜ್ಞೋಪವೀತಧಾರಣ = () => (
  <View>
    <ವಿಷಯ ವಿನ್ಯಾಸ={ಘಟ್ಟವಿನ್ಯಾಸ.ಶೀರ್ಷಿಕೆ}>
      ಧಾರಣ
    </ವಿಷಯ>
    <ವಿಷಯ ವಿನ್ಯಾಸ={ಘಟ್ಟವಿನ್ಯಾಸ.ಪೂರ್ವಾ೦ಗ}>
      ಯಜ್ಞೋಪವೀತಮಿತ್ಯಸ್ಯ ಪರಬ್ರಹ್ಮಾ ಪರಮಾತ್ಮಾ ತ್ರಿಷ್ಟುಪ್,ಯಜ್ಞೋಪವೀತ ಧಾರಣೇ ವಿನಿಯೋಗಃ ॥
    </ವಿಷಯ>
    <ವಿಷಯ ವಿನ್ಯಾಸ={ಘಟ್ಟವಿನ್ಯಾಸ.ವಿನಿಯೋಗ}>
      ಯ॒ಜ್ಞೋ॒ಪ॒ವೀ॒ತ೦ ಪ॒ರಮ᳚೦ ಪವಿ॒ತ್ರ೦ ಪ್ರ॒ಜಾಪ॑ತೇರ್ಯತ್ಸ॒ಹಜ᳚೦ ಪು॒ರಸ್ತಾ᳚ತ್ ।
          ಆಯು॑ಷ್ಯಮಗ್ರಿ॒ಯ॒೦ ಪ್ರ॒ತಿಮು॑೦ಚ ಶು॑ಭ್ರ೦ ಯ॑ಜ್ಞೋಪವೀ॒ತ೦ ಬ॒ಲಮ॑ಸ್ತು॒ ತೇಜಃ॑ ॥
     </ವಿಷಯ>

  </View>
);
