import React from 'react';

import ವಿನಿಯೋಗ from '../../Vishaya/Viniyoga';
import ಪೂರ್ವಾ೦ಗ from '../../Vishaya/Purvanga';
import ಶೀರ್ಷಿಕೆ from '../../Vishaya/Sheershike';
import ಆವರಣ from '../../Avarana/Avarana';
import ವಿಧಾನ from '../../Vishaya/Vidhana';
  
export default ಮ೦ತ್ರಪುಷ್ಪ = () => (
    <ಆವರಣ>
    <ಶೀರ್ಷಿಕೆ>
       ಮ೦ತ್ರಪುಷ್ಪ
    </ಶೀರ್ಷಿಕೆ>

    <ವಿನಿಯೋಗ >
       ಧಾ॒ತಾ ಪು॒ರಸ್ತಾ॒ದ್ಯಮು॑ದಾಜ॒ಹಾರ॑ । ಶ॒ಕ್ರಃ  ಪ್ರವಿ॒ದ್ವಾನ್-ಪ್ರ॒ದಿಶ॒ಶ್ಚತ॑ಸ್ರಃ । 
      ತಮೇ॒ವಂ ವಿ॒ದ್ವಾನ॒ಮೃತ॑ ಇ॒ಹ ಭ॑ವತಿ । ನಾನ್ಯಃ ಪಂಥಾ॒ ಅಯ॑ನಾಯ ವಿದ್ಯತೇ ।

     </ವಿನಿಯೋಗ>
     <ವಿನಿಯೋಗ>
      ರಾ॒ಜಾ॒ಧಿ॒ರಾ॒ಜಾಯ॑ ಪ್ರಸಹ್ಯಸಾ॒ಹಿನೇ᳚ । ನಮೋ॑ ವ॒ಯ೦ ವೈ॑ಶ್ರವ॒ಣಾಯ॑ ಕುರ್ಮಹೇ । 

      ಸಮೇ॒ ಕಾಮಾ॒ನ್-ಕಾಮ॒ ಕಾಮಾ॑ಯ॒ ಮಹ್ಯ᳚ಮ್ । ಕಾ॒ಮೇ॒ಶ್ವ॒ರೋ ವೈ᳚ಶ್ರವ॒ಣೋ ದ॑ದಾತು ।
      
      ಕುಬೇ॒ರಾಯ॑ ವೈಶ್ರವ॒ಣಾಯ॑ । ಮ॒ಹಾ॒ರಾ॒ಜಾಯ॒ ನಮಃ॑ ॥
     
     </ವಿನಿಯೋಗ>
    <ಪೂರ್ವಾ೦ಗ>

      ಶ್ರೀ ಇಷ್ಟ ದೇವತಾಭ್ಯೋ ನಮಃ । ವೇದೋಕ್ತ ಮಂತ್ರ ಪುಷ್ಪಾಣಿ ಸಪರ್ಪಯಾಮಿ ॥
      
    </ಪೂರ್ವಾ೦ಗ>

    </ಆವರಣ>
);
